MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c552xx.h
/* ================================================================================================================== */
/* ================                       Processor and Core Peripheral Section                      ================ */
/* ================================================================================================================== */

/* -------  Start of section using anonymous unions and disabling warnings  ------- */
#if   defined (__CC_ARM)
#pragma push
#pragma anon_unions
#elif defined (__ICCARM__)
#pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wc11-extensions"
#pragma clang diagnostic ignored "-Wreserved-id-macro"
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
#pragma warning 586
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
#warning Not supported compiler type
#endif /*__CC_ARM */

/* --------  Configuration of the Cortex-M33 Processor and Core Peripherals  ---------------- */
#define __CM33_REV                0x0004U   /*!< Cortex-M33 revision r0p4_p1                  */
#define __SAUREGION_PRESENT       0U        /*!< SAU regions not present                      */
#define __MPU_PRESENT             1U        /*!< MPU present                                  */
#define __VTOR_PRESENT            1U        /*!< VTOR present                                 */
#define __NVIC_PRIO_BITS          4U        /*!< Number of Bits used for Priority Levels      */
#define __Vendor_SysTickConfig    0U        /*!< Set to 1 if different SysTick Config is used */
#define __FPU_PRESENT             1U        /*!< FPU present                                  */
#define __DSP_PRESENT             1U        /*!< DSP extension present                        */

/** @} */ /* End of group Configuration_of_CMSIS */

#include <core_cm33.h>                       /*!< ARM Cortex-M33 processor and core peripherals */
#include "system_stm32c5xx.h"                /*!< STM32C5xx System */


/* ================================================================================================================== */
/* ================                         Device Specific Peripheral Section                       ================ */
/* ================================================================================================================== */


/** @addtogroup STM32C5xx_peripherals
  * @{
  */

/**
  * @brief ADC Analog to Digital Converter
  */
typedef struct
{
  __IOM uint32_t ISR;          /*!< ADC interrupt and status register,                     Address offset: 0x000 */
  __IOM uint32_t IER;          /*!< ADC interrupt enable register,                         Address offset: 0x004 */
  __IOM uint32_t CR;           /*!< ADC control register,                                  Address offset: 0x008 */
  __IOM uint32_t CFGR1;        /*!< ADC configuration register 1,                          Address offset: 0x00C */
  __IOM uint32_t CFGR2;        /*!< ADC configuration register 2,                          Address offset: 0x010 */
  __IOM uint32_t SMPR1;        /*!< ADC sample time register 1,                            Address offset: 0x014 */
  __IOM uint32_t SMPR2;        /*!< ADC sample time register 2,                            Address offset: 0x018 */
  __IOM uint32_t PCSEL;        /*!< ADC channel preselection register,                     Address offset: 0x01C */
        uint32_t RESERVED1[4]; /*!< Reserved,                                              Address offset: 0x020 */
  __IOM uint32_t SQR1;         /*!< ADC regular sequence register 1,                       Address offset: 0x030 */
  __IOM uint32_t SQR2;         /*!< ADC regular sequence register 2,                       Address offset: 0x034 */
  __IOM uint32_t SQR3;         /*!< ADC regular sequence register 3,                       Address offset: 0x038 */
  __IOM uint32_t SQR4;         /*!< ADC regular sequence register 4,                       Address offset: 0x03C */
  __IM  uint32_t DR;           /*!< ADC regular data register,                             Address offset: 0x040 */
        uint32_t RESERVED2[2]; /*!< Reserved,                                              Address offset: 0x044 */
  __IOM uint32_t JSQR;         /*!< ADC injected sequence register,                        Address offset: 0x04C */
  __IOM uint32_t OFCFGR[4];    /*!< ADC offset configuration register                      Address offset: 0x050 */
  __IOM uint32_t OFR[4];       /*!< ADC offset register                                    Address offset: 0x060 */
  __IOM uint32_t GCOMP;        /*!< ADC gain compensation register,                        Address offset: 0x070 */
        uint32_t RESERVED3[3]; /*!< Reserved,                                              Address offset: 0x074 */
  __IM  uint32_t JDR[4];       /*!< ADC injected channel data register                     Address offset: 0x080 */
        uint32_t RESERVED4[4]; /*!< Reserved,                                              Address offset: 0x090 */
  __IOM uint32_t AWD2CR;       /*!< ADC analog watchdog 2 configuration register,          Address offset: 0x0A0 */
  __IOM uint32_t AWD3CR;       /*!< ADC analog watchdog 3 configuration register,          Address offset: 0x0A4 */
  __IOM uint32_t AWD1LTR;      /*!< ADC analog watchdog 1 lower threshold register,        Address offset: 0x0A8 */
  __IOM uint32_t AWD1HTR;      /*!< ADC analog watchdog 1 higher threshold register,       Address offset: 0x0AC */
  __IOM uint32_t AWD2LTR;      /*!< ADC analog watchdog 2 lower threshold register,        Address offset: 0x0B0 */
  __IOM uint32_t AWD2HTR;      /*!< ADC analog watchdog 2 higher threshold register,       Address offset: 0x0B4 */
  __IOM uint32_t AWD3LTR;      /*!< ADC analog watchdog 3 lower threshold register,        Address offset: 0x0B8 */
  __IOM uint32_t AWD3HTR;      /*!< ADC analog watchdog 3 higher threshold register,       Address offset: 0x0BC */
        uint32_t RESERVED5;    /*!< Reserved,                                              Address offset: 0x0C0 */
  __IOM uint32_t CALFACT;      /*!< ADC calibration factors,                               Address offset: 0x0C4 */
} ADC_TypeDef;

typedef struct
{
  __IM  uint32_t CSR;          /*!< ADC common status register,                            Address offset: 0x000 */
        uint32_t RESERVED;     /*!< Reserved,                                              Address offset: 0x004 */
  __IOM uint32_t CCR;          /*!< ADC common control register,                           Address offset: 0x008 */
  __IM  uint32_t CDR;          /*!< ADC common regular data register for dual mode,        Address offset: 0x00C */
  __IM  uint32_t CDR2;         /*!< ADC common regular data register for dual mode,        Address offset: 0x010 */
} ADC_Common_TypeDef;


/**
  * @brief Comparator
  */
typedef struct
{
  __IM  uint32_t SR;         /*!< Comparator status register,                   Address offset: 0x00 */
  __IOM uint32_t ICFR;       /*!< Comparator interrupt clear flag register,     Address offset: 0x04 */
        uint32_t RESERVED1;  /*!< Reserved,                                     Address offset: 0x08 */
  __IOM uint32_t CFGR1;      /*!< Comparator configuration register 1,          Address offset: 0x0C */
  __IOM uint32_t CFGR2;      /*!< Comparator configuration register 2,          Address offset: 0x10 */
} COMP_TypeDef;

/**
  * @brief CORDIC
  */
typedef struct
{
  __IOM uint32_t CSR;            /*!< CORDIC control and status register,        Address offset: 0x00 */
  __OM  uint32_t WDATA;          /*!< CORDIC argument register,                  Address offset: 0x04 */
  __IM  uint32_t RDATA;          /*!< CORDIC result register,                    Address offset: 0x08 */
} CORDIC_TypeDef;

/**
  * @brief CRC calculation unit
  */
typedef struct
{
  __IOM  uint32_t DR;               /*!< CRC Data register,                                   Address offset: 0x00 */
  __IOM  uint32_t IDR;              /*!< CRC Independent data register,                       Address offset: 0x04 */
  __IOM  uint32_t CR;               /*!< CRC Control register,                                Address offset: 0x08 */
         uint32_t RESERVED1;        /*!< Reserved,                                            Address offset: 0x0C */
  __IOM  uint32_t INIT;             /*!< Initial CRC value register,                          Address offset: 0x10 */
  __IOM  uint32_t POL;              /*!< CRC polynomial register,                             Address offset: 0x14 */
} CRC_TypeDef;

/**
  * @brief Clock Recovery System
  */
typedef struct
{
  __IOM uint32_t CR;           /*!< CRS control register,                           Address offset: 0x00 */
  __IOM uint32_t CFGR;         /*!< CRS configuration register,                     Address offset: 0x04 */
  __IM  uint32_t ISR;          /*!< CRS interrupt and status register,              Address offset: 0x08 */
  __IOM uint32_t ICR;          /*!< CRS interrupt flag clear register,              Address offset: 0x0C */
} CRS_TypeDef;

/**
  * @brief Digital to Analog Converter
  */
typedef struct
{
  __IOM uint32_t CR;            /*!< DAC control register,                                     Address offset: 0x000 */
  __OM  uint32_t SWTRGR;        /*!< DAC software trigger register,                            Address offset: 0x004 */
  __IOM uint32_t DHR12R1;       /*!< DAC channel1 12-bit right-aligned data holding register,  Address offset: 0x008 */
  __IOM uint32_t DHR12L1;       /*!< DAC channel1 12-bit left aligned data holding register,   Address offset: 0x00C */
  __IOM uint32_t DHR8R1;        /*!< DAC channel1 8-bit right aligned data holding register,   Address offset: 0x010 */
        uint32_t RESERVED1[6];  /*!< Reserved,                                                 Address offset: 0x014 */
  __IM  uint32_t DOR1;          /*!< DAC channel1 data output register,                        Address offset: 0x02C */
        uint32_t RESERVED2;     /*!< Reserved,                                                 Address offset: 0x030 */
  __IOM uint32_t SR;            /*!< DAC status register,                                      Address offset: 0x034 */
  __IOM uint32_t CCR;           /*!< DAC calibration control register,                         Address offset: 0x038 */
  __IOM uint32_t MCR;           /*!< DAC mode control register,                                Address offset: 0x03C */
  __IOM uint32_t SHSR1;         /*!< DAC channel1 sample and hold sample time register,        Address offset: 0x040 */
        uint32_t RESERVED3;     /*!< Reserved,                                                 Address offset: 0x044 */
  __IOM uint32_t SHHR;          /*!< DAC sample and hold time register,                        Address offset: 0x048 */
  __IOM uint32_t SHRR;          /*!< DAC sample and hold refresh time register,                Address offset: 0x04C */
} DAC_TypeDef;

/**
  * @brief Debug MCU (DBGMCU)
  */
typedef struct
{
  __IM  uint32_t IDCODE;          /*!< DBGMCU identity code register,                           Address offset: 0x000 */
  __IOM uint32_t CR;              /*!< DBGMCU configuration register,                           Address offset: 0x004 */
  __IOM uint32_t APB1LFZR;        /*!< DBGMCU APB1L peripheral freeze register,                 Address offset: 0x008 */
  __IOM uint32_t APB1HFZR;        /*!< Debug MCU APB1 freeze register 2,                        Address offset: 0x00C */
  __IOM uint32_t APB2FZR;         /*!< DBGMCU APB2 peripheral freeze register,                  Address offset: 0x010 */
  __IOM uint32_t APB3FZR;         /*!< DBGMCU APB3 peripheral freeze register,                  Address offset: 0x014 */
        uint32_t RESERVED2[2];    /*!< Reserved,                                                Address offset: 0x018 */
  __IOM uint32_t AHB1FZR;         /*!< DBGMCU AHB1 peripheral freeze register,                  Address offset: 0x020 */
        uint32_t RESERVED3[54];   /*!< Reserved,                                                Address offset: 0x024 */
  __OM  uint32_t SR;              /*!< DBGMCU status register,                                  Address offset: 0x0FC */
  __IOM uint32_t DBG_AUTH_HOST;   /*!< DBGMCU debug authentication mailbox host register,       Address offset: 0x100 */
  __IM  uint32_t DBG_AUTH_DEVICE; /*!< DBGMCU debug authentication mailbox device register,     Address offset: 0x104 */
        uint32_t RESERVED4;       /*!< Reserved,                                                Address offset: 0x108 */
  __IOM uint32_t DBG_BSKEY_PWD;   /*!< DBGMCU boundary-scan key password register,              Address offset: 0x10C */
  __IM  uint32_t DBG_VALR;        /*!< DBGMCU debug OEMKEY validation register,                 Address offset: 0x110 */
        uint32_t RESERVED5[943];  /*!< Reserved,                                                Address offset: 0x114 */
  __IM  uint32_t PIDR4;           /*!< DBGMCU CoreSight peripheral identity register 4,         Address offset: 0xFD0 */
        uint32_t RESERVED6[3];    /*!< Reserved,                                                Address offset: 0xFD4 */
  __IM  uint32_t PIDR0;           /*!< DBGMCU CoreSight peripheral identity register 0,         Address offset: 0xFE0 */
  __IM  uint32_t PIDR1;           /*!< DBGMCU CoreSight peripheral identity register 1,         Address offset: 0xFE4 */
  __IM  uint32_t PIDR2;           /*!< DBGMCU CoreSight peripheral identity register 2,         Address offset: 0xFE8 */
  __IM  uint32_t PIDR3;           /*!< DBGMCU CoreSight peripheral identity register 3,         Address offset: 0xFEC */
  __IM  uint32_t CIDR0;           /*!< DBGMCU CoreSight component identity register 0,          Address offset: 0xFF0 */
  __IM  uint32_t CIDR1;           /*!< DBGMCU CoreSight component identity register 1,          Address offset: 0xFF4 */
  __IM  uint32_t CIDR2;           /*!< DBGMCU CoreSight component identity register 2,          Address offset: 0xFF8 */
  __IM  uint32_t CIDR3;           /*!< DBGMCU CoreSight component identity register 3,          Address offset: 0xFFC */
} DBGMCU_TypeDef;

/**
  * @brief DMA Controller (DMA)
  */
typedef struct
{
        uint32_t RESERVED1;     /*!< Reserved 1,                                      Address offset: 0x00 */
  __IOM uint32_t PRIVCFGR;      /*!< DMA privileged configuration register,           Address offset: 0x04 */
  __IOM uint32_t RCFGLOCKR;     /*!< DMA configuration lock register,                 Address offset: 0x08 */
  __IM  uint32_t MISR;          /*!< DMA masked interrupt status register,            Address offset: 0x0C */
        uint32_t RESERVED2;     /*!< Reserved 2,                                      Address offset: 0x10 */
} DMA_TypeDef;

typedef struct
{
  __IOM uint32_t CLBAR;          /*!< DMA channel x linked-list base address register, Address offset: 0x50 + (x * 0x80) */
        uint32_t RESERVED1[2];   /*!< Reserved 1,                                      Address offset: 0x54 -- 0x58      */
  __OM  uint32_t CFCR;           /*!< DMA channel x flag clear register,               Address offset: 0x5C + (x * 0x80) */
  __IM  uint32_t CSR;            /*!< DMA channel x flag status register,              Address offset: 0x60 + (x * 0x80) */
  __IOM uint32_t CCR;            /*!< DMA channel x control register,                  Address offset: 0x64 + (x * 0x80) */
        uint32_t RESERVED2[10];  /*!< Reserved 2,                                      Address offset: 0x68 -- 0x8C      */
  __IOM uint32_t CTR1;           /*!< DMA channel x transfer register 1,               Address offset: 0x90 + (x * 0x80) */
  __IOM uint32_t CTR2;           /*!< DMA channel x transfer register 2,               Address offset: 0x94 + (x * 0x80) */
  __IOM uint32_t CBR1;           /*!< DMA channel x block register 1,                  Address offset: 0x98 + (x * 0x80) */
  __IOM uint32_t CSAR;           /*!< DMA channel x source address register,           Address offset: 0x9C + (x * 0x80) */
  __IOM uint32_t CDAR;           /*!< DMA channel x destination address register,      Address offset: 0xA0 + (x * 0x80) */
        uint32_t RESERVED3[10];  /*!< Reserved 3,                                      Address offset: 0xA4 -- 0xC8      */
  __IOM uint32_t CLLR;           /*!< DMA channel x linked-list address register,      Address offset: 0xCC + (x * 0x80) */
} DMA_Channel_TypeDef;

/**
  * @brief Extended interrupts and event controller (EXTI)
  */
typedef struct
{
  __IOM uint32_t RTSR1;          /*!< EXTI Rising Trigger Selection Register 1,        Address offset:   0x000 */
  __IOM uint32_t FTSR1;          /*!< EXTI Falling Trigger Selection Register 1,       Address offset:   0x004 */
  __IOM uint32_t SWIER1;         /*!< EXTI Software Interrupt event Register 1,        Address offset:   0x008 */
  __IOM uint32_t RPR1;           /*!< EXTI Rising Pending Register 1,                  Address offset:   0x00C */
  __IOM uint32_t FPR1;           /*!< EXTI Falling Pending Register 1,                 Address offset:   0x010 */
        uint32_t RESERVED1;      /*!< Reserved,                                        Address offset:   0x014 */
  __IOM uint32_t PRIVCFGR1;      /*!< EXTI Privilege Configuration Register 1,         Address offset:   0x018 */
        uint32_t RESERVED2;      /*!< Reserved,                                        Address offset:   0x01C */
  __IOM uint32_t RTSR2;          /*!< EXTI Rising Trigger Selection Register 2,        Address offset:   0x020 */
  __IOM uint32_t FTSR2;          /*!< EXTI Falling Trigger Selection Register 2,       Address offset:   0x024 */
  __IOM uint32_t SWIER2;         /*!< EXTI Software Interrupt event Register 2,        Address offset:   0x028 */
  __IOM uint32_t RPR2;           /*!< EXTI Rising Pending Register 2,                  Address offset:   0x02C */
  __IOM uint32_t FPR2;           /*!< EXTI Falling Pending Register 2,                 Address offset:   0x030 */
        uint32_t RESERVED3;      /*!< Reserved,                                        Address offset:   0x034 */
  __IOM uint32_t PRIVCFGR2;      /*!< EXTI Privilege Configuration Register 2,         Address offset:   0x038 */
        uint32_t RESERVED4[9];   /*!< Reserved,                                        Address offset:   0x03C */
  __IOM uint32_t EXTICR[4];      /*!< EXIT External Interrupt Configuration Register,  Address offset:   0x060 */
        uint32_t RESERVED5[4];   /*!< Reserved,                                        Address offset:   0x070 */
  __IOM uint32_t IMR1;           /*!< EXTI Interrupt Mask Register 1,                  Address offset:   0x080 */
  __IOM uint32_t EMR1;           /*!< EXTI Event Mask Register 1,                      Address offset:   0x084 */
        uint32_t RESERVED6[2];   /*!< Reserved,                                        Address offset:   0x088 */
  __IOM uint32_t IMR2;           /*!< EXTI Interrupt Mask Register 2,                  Address offset:   0x090 */
  __IOM uint32_t EMR2;           /*!< EXTI Event Mask Register 2,                      Address offset:   0x094 */
} EXTI_TypeDef;

