MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c552xx.h
/* ================================================================================================================== */
/* ================                      Internal Oscillator Values adaptation                       ================ */
/* ================================================================================================================== */
/**
  * @brief Internal High Speed oscillator (HSI) reset value.
  *        This value is the default HSI range value after Reset.
  */
#if !defined(HSI_RESET_VALUE)
#define HSI_RESET_VALUE          4800000UL /*!< HSI resetValue of the Internal oscillator in Hz */
#endif /* !HSI_RESET_VALUE */


/**
  * @brief Internal High Speed oscillator (HSI) value.
  *        This value is used by the RCC HAL module to compute the system frequency
  *        (when HSI is used as system clock source, directly or through the PSI).
  */
#if !defined(HSI_VALUE)
#define HSI_VALUE               144000000UL /*!< Value of the Internal oscillator in Hz */
#endif /* !HSI_VALUE */

/**
  * @brief Internal High Speed oscillator (HSI48) value for USB FS and RNG.
  *        This internal oscillator is mainly dedicated to provide a high precision clock to
  *        the USB peripheral by means of a special Clock Recovery System (CRS) circuitry.
  *        When the CRS is not used, the HSI48 RC oscillator runs on it default frequency
  *        which is subject to manufacturing process variations.
  */
#if !defined(HSI48_VALUE)
#define HSI48_VALUE             48000000UL /*!< Value of the Internal High Speed oscillator for USB FS/RNG in Hz.
                                          The real value my vary depending on manufacturing process variations.*/
#endif /* !HSI48_VALUE */

/**
  * @brief Internal Low Speed oscillator (LSI) value.
  */
#if !defined(LSI_VALUE)
#define LSI_VALUE                  32000UL    /*!< LSI Typical Value in Hz*/
/*!< Value of the Internal Low Speed oscillator in Hz
   The real value may vary depending on the variations
   in voltage and temperature.*/
#endif /* !LSI_VALUE */

/* ================================================================================================================== */
/* ================                      Device Specific Peripheral Address Map                      ================ */
/* ================================================================================================================== */


/** @addtogroup STM32C5xx_Peripheral_peripheralAddr
  * @{
  */

/* Internal SRAMs size */
#define SRAM1_SIZE               (0x10000UL)    /*!< SRAM1=64k  */
#define SRAM2_SIZE               (0x10000UL)    /*!< SRAM2=64k  */

/* Flash, Peripheral and internal SRAMs base addresses */
#define FLASH_BASE               (0x08000000UL) /*!< FLASH (512 KB) base address            */
#define SRAM1_BASE               (0x20000000UL) /*!< SRAM1 (64 KB) base address             */
#define SRAM2_BASE               (0x20010000UL) /*!< SRAM2 (64 KB) base address             */
#define PERIPH_BASE              (0x40000000UL) /*!< Peripheral base address                */

/*!< Flash OTP area */
#define FLASH_OTP_BASE           (0x08FFE000UL) /*!< FLASH OTP (one-time programmable) base address */

/*!< Flash read-only area */
#define UID_BASE                 (0x08FFF800UL) /*!< Unique 96-bit device ID register base address */
#define FLASHSIZE_BASE           (0x08FFF80CUL) /*!< Flash size data register base address  */
#define PACKAGE_BASE             (0x08FFF80EUL) /*!< Package data register base address     */

/* Flash DATA Area */
#define FLASH_EXT_USER_BASE      (0x08400000UL) /*!< FLASH extended user base address   */
#define FLASH_EDATA_BASE         (0x09000000UL) /*!< FLASH high-cycle data base address */

/*!< Flash system area */
#define FLASH_SYSTEM_BASE        (0x0BF80000UL) /*!< System FLASH non-secure base address  */
#define FLASH_SYSTEM_SIZE        (0x10000U)     /*!< 64 Kbytes OTP (one-time programmable) */

/* Peripheral memory map */
#define APB1PERIPH_BASE          PERIPH_BASE
#define APB2PERIPH_BASE          (PERIPH_BASE + 0x00010000UL)
#define AHB1PERIPH_BASE          (PERIPH_BASE + 0x00020000UL)
#define AHB2PERIPH_BASE          (PERIPH_BASE + 0x02020000UL)
#define APB3PERIPH_BASE          (PERIPH_BASE + 0x04000000UL)
#define AHB3PERIPH_BASE          (PERIPH_BASE + 0x04020000UL)

/*!< APB1 peripherals */
#define TIM2_BASE                (APB1PERIPH_BASE + 0x0000UL)
#define TIM5_BASE                (APB1PERIPH_BASE + 0x0C00UL)
#define TIM6_BASE                (APB1PERIPH_BASE + 0x1000UL)
#define TIM7_BASE                (APB1PERIPH_BASE + 0x1400UL)
#define TIM12_BASE               (APB1PERIPH_BASE + 0x1800UL)
#define WWDG_BASE                (APB1PERIPH_BASE + 0x2C00UL)
#define IWDG_BASE                (APB1PERIPH_BASE + 0x3000UL)
#define SPI2_BASE                (APB1PERIPH_BASE + 0x3800UL)
#define SPI3_BASE                (APB1PERIPH_BASE + 0x3C00UL)
#define COMP1_BASE               (APB1PERIPH_BASE + 0x4000UL)
#define USART2_BASE              (APB1PERIPH_BASE + 0x4400UL)
#define USART3_BASE              (APB1PERIPH_BASE + 0x4800UL)
#define UART4_BASE               (APB1PERIPH_BASE + 0x4C00UL)
#define UART5_BASE               (APB1PERIPH_BASE + 0x5000UL)
#define I2C1_BASE                (APB1PERIPH_BASE + 0x5400UL)
#define I2C2_BASE                (APB1PERIPH_BASE + 0x5800UL)
#define I3C1_BASE                (APB1PERIPH_BASE + 0x5C00UL)
#define CRS_BASE                 (APB1PERIPH_BASE + 0x6000UL)
#define FDCAN1_BASE              (APB1PERIPH_BASE + 0xA400UL)
#define FDCAN_CONFIG_BASE        (APB1PERIPH_BASE + 0xA500UL)
#define SRAMCAN_BASE             (APB1PERIPH_BASE + 0xAC00UL)

/*!< APB2 peripherals */
#define TIM1_BASE                (APB2PERIPH_BASE + 0x2C00UL)
#define SPI1_BASE                (APB2PERIPH_BASE + 0x3000UL)
#define TIM8_BASE                (APB2PERIPH_BASE + 0x3400UL)
#define USART1_BASE              (APB2PERIPH_BASE + 0x3800UL)
#define TIM15_BASE               (APB2PERIPH_BASE + 0x4000UL)
#define TIM16_BASE               (APB2PERIPH_BASE + 0x4400UL)
#define TIM17_BASE               (APB2PERIPH_BASE + 0x4800UL)
#define USB_DRD_FS_BASE          (APB2PERIPH_BASE + 0x6000UL)
#define USB_DRD_PMAADDR          (APB2PERIPH_BASE + 0x6400UL)

/*!< APB3 peripherals */
#define SBS_BASE                 (APB3PERIPH_BASE + 0x0400UL)
#define LPUART1_BASE             (APB3PERIPH_BASE + 0x2400UL)
#define LPTIM1_BASE              (APB3PERIPH_BASE + 0x4400UL)
#define RTC_BASE                 (APB3PERIPH_BASE + 0x7800UL)
#define TAMP_BASE                (APB3PERIPH_BASE + 0x7C00UL)


/*!< AHB1 peripherals */
#define LPDMA1_BASE              (AHB1PERIPH_BASE)
#define LPDMA1_CH0_BASE          (LPDMA1_BASE + 0x0050UL)
#define LPDMA1_CH1_BASE          (LPDMA1_BASE + 0x00D0UL)
#define LPDMA1_CH2_BASE          (LPDMA1_BASE + 0x0150UL)
#define LPDMA1_CH3_BASE          (LPDMA1_BASE + 0x01D0UL)
#define LPDMA1_CH4_BASE          (LPDMA1_BASE + 0x0250UL)
#define LPDMA1_CH5_BASE          (LPDMA1_BASE + 0x02D0UL)
#define LPDMA1_CH6_BASE          (LPDMA1_BASE + 0x0350UL)
#define LPDMA1_CH7_BASE          (LPDMA1_BASE + 0x03D0UL)
#define LPDMA2_BASE              (AHB1PERIPH_BASE + 0x01000UL)
#define LPDMA2_CH0_BASE          (LPDMA2_BASE + 0x0050UL)
#define LPDMA2_CH1_BASE          (LPDMA2_BASE + 0x00D0UL)
#define LPDMA2_CH2_BASE          (LPDMA2_BASE + 0x0150UL)
#define LPDMA2_CH3_BASE          (LPDMA2_BASE + 0x01D0UL)
#define FLASH_R_BASE             (AHB1PERIPH_BASE + 0x02000UL)
#define CRC_BASE                 (AHB1PERIPH_BASE + 0x03000UL)
#define CORDIC_BASE              (AHB1PERIPH_BASE + 0x03800UL)
#define RAMCFG_BASE              (AHB1PERIPH_BASE + 0x06000UL)
#define RAMCFG_SRAM1_BASE        (RAMCFG_BASE)
#define RAMCFG_SRAM2_BASE        (RAMCFG_BASE + 0x0040UL)
#define ICACHE_BASE              (AHB1PERIPH_BASE + 0x10400UL)

/*!< AHB2 peripherals */
#define GPIOA_BASE               (AHB2PERIPH_BASE + 0x00000UL)
#define GPIOB_BASE               (AHB2PERIPH_BASE + 0x00400UL)
#define GPIOC_BASE               (AHB2PERIPH_BASE + 0x00800UL)
#define GPIOD_BASE               (AHB2PERIPH_BASE + 0x00C00UL)
#define GPIOE_BASE               (AHB2PERIPH_BASE + 0x01000UL)
#define GPIOH_BASE               (AHB2PERIPH_BASE + 0x01C00UL)
#define ADC1_BASE                (AHB2PERIPH_BASE + 0x08000UL)
#define ADC2_BASE                (AHB2PERIPH_BASE + 0x08100UL)
#define ADC12_COMMON_BASE        (AHB2PERIPH_BASE + 0x08300UL)
#define DAC1_BASE                (AHB2PERIPH_BASE + 0x08400UL)
#define HASH_BASE                (AHB2PERIPH_BASE + 0xA0400UL)
#define RNG_BASE                 (AHB2PERIPH_BASE + 0xA0800UL)

/*!< AHB3 peripherals */
#define PWR_BASE                 (AHB3PERIPH_BASE + 0x0800UL)
#define RCC_BASE                 (AHB3PERIPH_BASE + 0x0C00UL)
#define EXTI_BASE                (AHB3PERIPH_BASE + 0x2000UL)
#define DBGMCU_BASE              (AHB3PERIPH_BASE + 0x4000UL)

/*!< Exit Hide Protection Library */
/* ***************************** EXITHDPLIB system Flash region definition constants ******************************** */
#define EXITHDPLIB_SYS_FLASH_PFUNC_START   (0x0BF883E0UL)

/* ********************************** EXITHDPLIB function return constants ****************************************** */
#define EXITHDPLIB_ERROR   (0xF5F5F5F5UL)

/*!< EXITHDPLIB pointer function structure address definition */
#define EXITHDPLIB_PFUNC_BASE EXITHDPLIB_SYS_FLASH_PFUNC_START
#define EXITHDPLIB_PFUNC      ((EXITHDPLIB_pFunc_TypeDef *)EXITHDPLIB_PFUNC_BASE)

/**
  * @brief  Prototype of EXITHDPLIB JumpHDPLvl2/3 Functions.
  * @detail This function close the requested hdp area passed in input
  *         parameter and jump to the reset handler present within the
  *         Vector table. The function does not return on successful execution.
  * @param  VectorTableAddr: Address of the next vector table to apply.
  * @param  MPUIndex: MPU region index to enable before jumping.
  * @retval EXITHDPLIB_ERROR on error, otherwise does not return.
  */
typedef uint32_t (*EXITHDPLIB_JumpHDP_TypeDef)(uint32_t VectorTableAddr, uint32_t MPUIndex);

/**
  * @brief  EXITHDPLIB function pointer structure
  */
typedef struct
{
  uint32_t                   Reserved[3];    /*!< Address offset: 0x00 */
  EXITHDPLIB_JumpHDP_TypeDef JumpHDPLvl2;    /*!< Address offset: 0x0C */
  EXITHDPLIB_JumpHDP_TypeDef JumpHDPLvl3;    /*!< Address offset: 0x10 */
} EXITHDPLIB_pFunc_TypeDef;

/** @} */ /* End of group STM32C5xx_Peripheral_peripheralAddr */


