MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c552xx.h
/* ************************************  Bit definition for ADC_SMPR2 register  ************************************* */
#define ADC_SMPR2_SMP10_Pos      (0U)
#define ADC_SMPR2_SMP10_Msk      (0x7UL << ADC_SMPR2_SMP10_Pos)        /*!< 0x00000007 */
#define ADC_SMPR2_SMP10          ADC_SMPR2_SMP10_Msk                   /*!< Channel x sampling time selection (x = 13 to
                                                                            10) */
#define ADC_SMPR2_SMP10_0        (0x1UL << ADC_SMPR2_SMP10_Pos)        /*!< 0x00000001 */
#define ADC_SMPR2_SMP10_1        (0x2UL << ADC_SMPR2_SMP10_Pos)        /*!< 0x00000002 */
#define ADC_SMPR2_SMP10_2        (0x4UL << ADC_SMPR2_SMP10_Pos)        /*!< 0x00000004 */
#define ADC_SMPR2_SMP11_Pos      (3U)
#define ADC_SMPR2_SMP11_Msk      (0x7UL << ADC_SMPR2_SMP11_Pos)        /*!< 0x00000038 */
#define ADC_SMPR2_SMP11          ADC_SMPR2_SMP11_Msk                   /*!< Channel x sampling time selection (x = 13 to
                                                                            10) */
#define ADC_SMPR2_SMP11_0        (0x1UL << ADC_SMPR2_SMP11_Pos)        /*!< 0x00000008 */
#define ADC_SMPR2_SMP11_1        (0x2UL << ADC_SMPR2_SMP11_Pos)        /*!< 0x00000010 */
#define ADC_SMPR2_SMP11_2        (0x4UL << ADC_SMPR2_SMP11_Pos)        /*!< 0x00000020 */
#define ADC_SMPR2_SMP12_Pos      (6U)
#define ADC_SMPR2_SMP12_Msk      (0x7UL << ADC_SMPR2_SMP12_Pos)        /*!< 0x000001C0 */
#define ADC_SMPR2_SMP12          ADC_SMPR2_SMP12_Msk                   /*!< Channel x sampling time selection (x = 13 to
                                                                            10) */
#define ADC_SMPR2_SMP12_0        (0x1UL << ADC_SMPR2_SMP12_Pos)        /*!< 0x00000040 */
#define ADC_SMPR2_SMP12_1        (0x2UL << ADC_SMPR2_SMP12_Pos)        /*!< 0x00000080 */
#define ADC_SMPR2_SMP12_2        (0x4UL << ADC_SMPR2_SMP12_Pos)        /*!< 0x00000100 */
#define ADC_SMPR2_SMP13_Pos      (9U)
#define ADC_SMPR2_SMP13_Msk      (0x7UL << ADC_SMPR2_SMP13_Pos)        /*!< 0x00000E00 */
#define ADC_SMPR2_SMP13          ADC_SMPR2_SMP13_Msk                   /*!< Channel x sampling time selection (x = 13 to
                                                                            10) */
#define ADC_SMPR2_SMP13_0        (0x1UL << ADC_SMPR2_SMP13_Pos)        /*!< 0x00000200 */
#define ADC_SMPR2_SMP13_1        (0x2UL << ADC_SMPR2_SMP13_Pos)        /*!< 0x00000400 */
#define ADC_SMPR2_SMP13_2        (0x4UL << ADC_SMPR2_SMP13_Pos)        /*!< 0x00000800 */

/* ************************************  Bit definition for ADC_PCSEL register  ************************************* */
#define ADC_PCSEL_PCSEL_Pos      (0U)
#define ADC_PCSEL_PCSEL_Msk      (0x3FFFUL << ADC_PCSEL_PCSEL_Pos)     /*!< 0x00003FFF */
#define ADC_PCSEL_PCSEL          ADC_PCSEL_PCSEL_Msk                   /*!< Channel i (V<sub>IN[i]</sub>) preselection
                                                                            */
#define ADC_PCSEL_PCSEL_0        (0x1UL << ADC_PCSEL_PCSEL_Pos)        /*!< 0x00000001 */
#define ADC_PCSEL_PCSEL_1        (0x2UL << ADC_PCSEL_PCSEL_Pos)        /*!< 0x00000002 */
#define ADC_PCSEL_PCSEL_2        (0x4UL << ADC_PCSEL_PCSEL_Pos)        /*!< 0x00000004 */
#define ADC_PCSEL_PCSEL_3        (0x8UL << ADC_PCSEL_PCSEL_Pos)        /*!< 0x00000008 */
#define ADC_PCSEL_PCSEL_4        (0x10UL << ADC_PCSEL_PCSEL_Pos)       /*!< 0x00000010 */
#define ADC_PCSEL_PCSEL_5        (0x20UL << ADC_PCSEL_PCSEL_Pos)       /*!< 0x00000020 */
#define ADC_PCSEL_PCSEL_6        (0x40UL << ADC_PCSEL_PCSEL_Pos)       /*!< 0x00000040 */
#define ADC_PCSEL_PCSEL_7        (0x80UL << ADC_PCSEL_PCSEL_Pos)       /*!< 0x00000080 */
#define ADC_PCSEL_PCSEL_8        (0x100UL << ADC_PCSEL_PCSEL_Pos)      /*!< 0x00000100 */
#define ADC_PCSEL_PCSEL_9        (0x200UL << ADC_PCSEL_PCSEL_Pos)      /*!< 0x00000200 */
#define ADC_PCSEL_PCSEL_10       (0x400UL << ADC_PCSEL_PCSEL_Pos)      /*!< 0x00000400 */
#define ADC_PCSEL_PCSEL_11       (0x800UL << ADC_PCSEL_PCSEL_Pos)      /*!< 0x00000800 */
#define ADC_PCSEL_PCSEL_12       (0x1000UL << ADC_PCSEL_PCSEL_Pos)     /*!< 0x00001000 */
#define ADC_PCSEL_PCSEL_13       (0x2000UL << ADC_PCSEL_PCSEL_Pos)     /*!< 0x00002000 */

/* *************************************  Bit definition for ADC_SQR1 register  ************************************* */
#define ADC_SQR1_LEN_Pos         (0U)
#define ADC_SQR1_LEN_Msk         (0xFUL << ADC_SQR1_LEN_Pos)           /*!< 0x0000000F */
#define ADC_SQR1_LEN             ADC_SQR1_LEN_Msk                      /*!< Regular channel sequence length */
#define ADC_SQR1_LEN_0           (0x1UL << ADC_SQR1_LEN_Pos)           /*!< 0x00000001 */
#define ADC_SQR1_LEN_1           (0x2UL << ADC_SQR1_LEN_Pos)           /*!< 0x00000002 */
#define ADC_SQR1_LEN_2           (0x4UL << ADC_SQR1_LEN_Pos)           /*!< 0x00000004 */
#define ADC_SQR1_LEN_3           (0x8UL << ADC_SQR1_LEN_Pos)           /*!< 0x00000008 */
#define ADC_SQR1_SQ1_Pos         (6U)
#define ADC_SQR1_SQ1_Msk         (0x1FUL << ADC_SQR1_SQ1_Pos)          /*!< 0x000007C0 */
#define ADC_SQR1_SQ1             ADC_SQR1_SQ1_Msk                      /*!< 1st conversion in regular sequence */
#define ADC_SQR1_SQ1_0           (0x1UL << ADC_SQR1_SQ1_Pos)           /*!< 0x00000040 */
#define ADC_SQR1_SQ1_1           (0x2UL << ADC_SQR1_SQ1_Pos)           /*!< 0x00000080 */
#define ADC_SQR1_SQ1_2           (0x4UL << ADC_SQR1_SQ1_Pos)           /*!< 0x00000100 */
#define ADC_SQR1_SQ1_3           (0x8UL << ADC_SQR1_SQ1_Pos)           /*!< 0x00000200 */
#define ADC_SQR1_SQ1_4           (0x10UL << ADC_SQR1_SQ1_Pos)          /*!< 0x00000400 */
#define ADC_SQR1_SQ2_Pos         (12U)
#define ADC_SQR1_SQ2_Msk         (0x1FUL << ADC_SQR1_SQ2_Pos)          /*!< 0x0001F000 */
#define ADC_SQR1_SQ2             ADC_SQR1_SQ2_Msk                      /*!< 2nd conversion in regular sequence */
#define ADC_SQR1_SQ2_0           (0x1UL << ADC_SQR1_SQ2_Pos)           /*!< 0x00001000 */
#define ADC_SQR1_SQ2_1           (0x2UL << ADC_SQR1_SQ2_Pos)           /*!< 0x00002000 */
#define ADC_SQR1_SQ2_2           (0x4UL << ADC_SQR1_SQ2_Pos)           /*!< 0x00004000 */
#define ADC_SQR1_SQ2_3           (0x8UL << ADC_SQR1_SQ2_Pos)           /*!< 0x00008000 */
#define ADC_SQR1_SQ2_4           (0x10UL << ADC_SQR1_SQ2_Pos)          /*!< 0x00010000 */
#define ADC_SQR1_SQ3_Pos         (18U)
#define ADC_SQR1_SQ3_Msk         (0x1FUL << ADC_SQR1_SQ3_Pos)          /*!< 0x007C0000 */
#define ADC_SQR1_SQ3             ADC_SQR1_SQ3_Msk                      /*!< 3rd conversion in regular sequence */
#define ADC_SQR1_SQ3_0           (0x1UL << ADC_SQR1_SQ3_Pos)           /*!< 0x00040000 */
#define ADC_SQR1_SQ3_1           (0x2UL << ADC_SQR1_SQ3_Pos)           /*!< 0x00080000 */
#define ADC_SQR1_SQ3_2           (0x4UL << ADC_SQR1_SQ3_Pos)           /*!< 0x00100000 */
#define ADC_SQR1_SQ3_3           (0x8UL << ADC_SQR1_SQ3_Pos)           /*!< 0x00200000 */
#define ADC_SQR1_SQ3_4           (0x10UL << ADC_SQR1_SQ3_Pos)          /*!< 0x00400000 */
#define ADC_SQR1_SQ4_Pos         (24U)
#define ADC_SQR1_SQ4_Msk         (0x1FUL << ADC_SQR1_SQ4_Pos)          /*!< 0x1F000000 */
#define ADC_SQR1_SQ4             ADC_SQR1_SQ4_Msk                      /*!< 4th conversion in regular sequence */
#define ADC_SQR1_SQ4_0           (0x1UL << ADC_SQR1_SQ4_Pos)           /*!< 0x01000000 */
#define ADC_SQR1_SQ4_1           (0x2UL << ADC_SQR1_SQ4_Pos)           /*!< 0x02000000 */
#define ADC_SQR1_SQ4_2           (0x4UL << ADC_SQR1_SQ4_Pos)           /*!< 0x04000000 */
#define ADC_SQR1_SQ4_3           (0x8UL << ADC_SQR1_SQ4_Pos)           /*!< 0x08000000 */
#define ADC_SQR1_SQ4_4           (0x10UL << ADC_SQR1_SQ4_Pos)          /*!< 0x10000000 */

