MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c552xx.h
/* ************************************  Bit definition for ADCC_CDR2 register  ************************************* */
#define ADCC_CDR2_RDATA_ALT_Pos (0U)
#define ADCC_CDR2_RDATA_ALT_Msk (0xFFFFFFFFUL << ADCC_CDR2_RDATA_ALT_Pos) /*!< 0xFFFFFFFF */
#define ADCC_CDR2_RDATA_ALT     ADCC_CDR2_RDATA_ALT_Msk         /*!< Regular data of the master/slave alternated ADCs */

/******************************************************************************/
/*                                                                            */
/*                          CRC calculation unit                              */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for CRC_DR register  *********************/
#define CRC_DR_DR_Pos                       (0U)
#define CRC_DR_DR_Msk                       (0xFFFFFFFFUL << CRC_DR_DR_Pos)         /*!< 0xFFFFFFFF */
#define CRC_DR_DR                           CRC_DR_DR_Msk                           /*!< Data register bits */

/*******************  Bit definition for CRC_IDR register  ********************/
#define CRC_IDR_IDR_Pos                     (0U)
#define CRC_IDR_IDR_Msk                     (0xFFFFFFFFUL << CRC_IDR_IDR_Pos)       /*!< 0xFFFFFFFF */
#define CRC_IDR_IDR                         CRC_IDR_IDR_Msk                         /*!< General-purpose 32-bits data register bits */

/********************  Bit definition for CRC_CR register  ********************/
#define CRC_CR_RESET_Pos           (0U)
#define CRC_CR_RESET_Msk           (0x1UL << CRC_CR_RESET_Pos)                 /*!< 0x00000001 */
#define CRC_CR_RESET               CRC_CR_RESET_Msk                            /*!< RESET the CRC computation unit bit */
#define CRC_CR_POLYSIZE_Pos        (3U)
#define CRC_CR_POLYSIZE_Msk        (0x3UL << CRC_CR_POLYSIZE_Pos)              /*!< 0x00000018 */
#define CRC_CR_POLYSIZE            CRC_CR_POLYSIZE_Msk                         /*!< Polynomial size bits */
#define CRC_CR_POLYSIZE_0          (0x1UL << CRC_CR_POLYSIZE_Pos)              /*!< 0x00000008 */
#define CRC_CR_POLYSIZE_1          (0x2UL << CRC_CR_POLYSIZE_Pos)              /*!< 0x00000010 */
#define CRC_CR_REV_IN_Pos          (5U)
#define CRC_CR_REV_IN_Msk          (0x3UL << CRC_CR_REV_IN_Pos)                /*!< 0x00000060 */
#define CRC_CR_REV_IN              CRC_CR_REV_IN_Msk                           /*!< REV_IN Reverse Input Data bits */
#define CRC_CR_REV_IN_0            (0x1UL << CRC_CR_REV_IN_Pos)                /*!< 0x00000020 */
#define CRC_CR_REV_IN_1            (0x2UL << CRC_CR_REV_IN_Pos)                /*!< 0x00000040 */
#define CRC_CR_REV_OUT_Pos         (7U)
#define CRC_CR_REV_OUT_Msk         (0x3UL << CRC_CR_REV_OUT_Pos)               /*!< 0x00000180 */
#define CRC_CR_REV_OUT             CRC_CR_REV_OUT_Msk                          /*!< REV_OUT Reverse Output Data bits */
#define CRC_CR_REV_OUT_0           (0x1UL << CRC_CR_REV_OUT_Pos)               /*!< 0x00000080 */
#define CRC_CR_REV_OUT_1           (0x2UL << CRC_CR_REV_OUT_Pos)               /*!< 0x00000100 */
#define CRC_CR_RTYPE_IN_Pos        (9U)
#define CRC_CR_RTYPE_IN_Msk        (0x1UL << CRC_CR_RTYPE_IN_Pos)              /*!< 0x00000200 */
#define CRC_CR_RTYPE_IN            CRC_CR_RTYPE_IN_Msk                         /*!< Reverse type input */
#define CRC_CR_RTYPE_OUT_Pos       (10U)
#define CRC_CR_RTYPE_OUT_Msk       (0x1UL << CRC_CR_RTYPE_OUT_Pos)             /*!< 0x00000400 */
#define CRC_CR_RTYPE_OUT           CRC_CR_RTYPE_OUT_Msk                        /*!< Reverse type output*/

/*******************  Bit definition for CRC_INIT register  *******************/
#define CRC_INIT_INIT_Pos                   (0U)
#define CRC_INIT_INIT_Msk                   (0xFFFFFFFFUL << CRC_INIT_INIT_Pos)     /*!< 0xFFFFFFFF */
#define CRC_INIT_INIT                       CRC_INIT_INIT_Msk                       /*!< Initial CRC value bits */

/*******************  Bit definition for CRC_POL register  ********************/
#define CRC_POL_POL_Pos                     (0U)
#define CRC_POL_POL_Msk                     (0xFFFFFFFFUL << CRC_POL_POL_Pos)       /*!< 0xFFFFFFFF */
#define CRC_POL_POL                         CRC_POL_POL_Msk                         /*!< Coefficients of the polynomial */

/******************************************************************************/
/*                                                                            */
/*                         Analog comparators (COMP)                          */
/*                                                                            */
/******************************************************************************/

/********************  Bit definition for COMP_SR register  ******************/
#define COMP_SR_C1VAL_Pos                   (0U)
#define COMP_SR_C1VAL_Msk                   (0x1UL << COMP_SR_C1VAL_Pos)          /*!< 0x00000001 */
#define COMP_SR_C1VAL                       COMP_SR_C1VAL_Msk

#define COMP_SR_C1IF_Pos                    (16U)
#define COMP_SR_C1IF_Msk                    (0x1UL << COMP_SR_C1IF_Pos)           /*!< 0x00010000 */
#define COMP_SR_C1IF                        COMP_SR_C1IF_Msk

/********************  Bit definition for COMP_ICFR register ******************/
#define COMP_ICFR_CC1IF_Pos                 (16U)
#define COMP_ICFR_CC1IF_Msk                 (0x1UL << COMP_ICFR_CC1IF_Pos)        /*!< 0x00010000 */
#define COMP_ICFR_CC1IF                     COMP_ICFR_CC1IF_Msk

/********************  Bit definition for COMP_CFGR1 register  ******************/
#define COMP_CFGR1_EN_Pos                   (0U)
#define COMP_CFGR1_EN_Msk                   (0x1UL << COMP_CFGR1_EN_Pos)          /*!< 0x00000001 */
#define COMP_CFGR1_EN                       COMP_CFGR1_EN_Msk                     /*!< Comparator enable */

#define COMP_CFGR1_BRGEN_Pos                (1U)
#define COMP_CFGR1_BRGEN_Msk                (0x1UL << COMP_CFGR1_BRGEN_Pos)       /*!< 0x00000002 */
#define COMP_CFGR1_BRGEN                    COMP_CFGR1_BRGEN_Msk                  /*!< Comparator scaler bridge enable */

