MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c552xx.h
/* **********************************  Bit definition for EXTI_PRIVCFGR2 register  ********************************** */
#define EXTI_PRIVCFGR2_PRIV32_Pos (0U)
#define EXTI_PRIVCFGR2_PRIV32_Msk (0x1UL << EXTI_PRIVCFGR2_PRIV32_Pos)   /*!< 0x00000001 */
#define EXTI_PRIVCFGR2_PRIV32     EXTI_PRIVCFGR2_PRIV32_Msk              /*!< Privilege enable on event input 32 */
#define EXTI_PRIVCFGR2_PRIV33_Pos (1U)
#define EXTI_PRIVCFGR2_PRIV33_Msk (0x1UL << EXTI_PRIVCFGR2_PRIV33_Pos)   /*!< 0x00000002 */
#define EXTI_PRIVCFGR2_PRIV33     EXTI_PRIVCFGR2_PRIV33_Msk              /*!< Privilege enable on event input 33 */
#define EXTI_PRIVCFGR2_PRIV34_Pos (2U)
#define EXTI_PRIVCFGR2_PRIV34_Msk (0x1UL << EXTI_PRIVCFGR2_PRIV34_Pos)   /*!< 0x00000004 */
#define EXTI_PRIVCFGR2_PRIV34     EXTI_PRIVCFGR2_PRIV34_Msk              /*!< Privilege enable on event input 34 */
#define EXTI_PRIVCFGR2_PRIV35_Pos (3U)
#define EXTI_PRIVCFGR2_PRIV35_Msk (0x1UL << EXTI_PRIVCFGR2_PRIV35_Pos)   /*!< 0x00000008 */
#define EXTI_PRIVCFGR2_PRIV35     EXTI_PRIVCFGR2_PRIV35_Msk              /*!< Privilege enable on event input 35 */

/* ***********************************  Bit definition for EXTI_EXTICR1 register  *********************************** */
#define EXTI_EXTICR1_EXTI0_Pos    (0U)
#define EXTI_EXTICR1_EXTI0_Msk    (0xFFUL << EXTI_EXTICR1_EXTI0_Pos)     /*!< 0x000000FF */
#define EXTI_EXTICR1_EXTI0        EXTI_EXTICR1_EXTI0_Msk                 /*!< EXTI0 GPIO port selection */
#define EXTI_EXTICR1_EXTI0_0      (0x1UL << EXTI_EXTICR1_EXTI0_Pos)      /*!< 0x00000001 */
#define EXTI_EXTICR1_EXTI0_1      (0x2UL << EXTI_EXTICR1_EXTI0_Pos)      /*!< 0x00000002 */
#define EXTI_EXTICR1_EXTI0_2      (0x4UL << EXTI_EXTICR1_EXTI0_Pos)      /*!< 0x00000004 */
#define EXTI_EXTICR1_EXTI0_3      (0x8UL << EXTI_EXTICR1_EXTI0_Pos)      /*!< 0x00000008 */
#define EXTI_EXTICR1_EXTI1_Pos    (8U)
#define EXTI_EXTICR1_EXTI1_Msk    (0xFFUL << EXTI_EXTICR1_EXTI1_Pos)     /*!< 0x0000FF00 */
#define EXTI_EXTICR1_EXTI1        EXTI_EXTICR1_EXTI1_Msk                 /*!< EXTI1 GPIO port selection */
#define EXTI_EXTICR1_EXTI1_0      (0x1UL << EXTI_EXTICR1_EXTI1_Pos)      /*!< 0x00000100 */
#define EXTI_EXTICR1_EXTI1_1      (0x2UL << EXTI_EXTICR1_EXTI1_Pos)      /*!< 0x00000200 */
#define EXTI_EXTICR1_EXTI1_2      (0x4UL << EXTI_EXTICR1_EXTI1_Pos)      /*!< 0x00000400 */
#define EXTI_EXTICR1_EXTI1_3      (0x8UL << EXTI_EXTICR1_EXTI1_Pos)      /*!< 0x00000800 */
#define EXTI_EXTICR1_EXTI2_Pos    (16U)
#define EXTI_EXTICR1_EXTI2_Msk    (0xFFUL << EXTI_EXTICR1_EXTI2_Pos)     /*!< 0x00FF0000 */
#define EXTI_EXTICR1_EXTI2        EXTI_EXTICR1_EXTI2_Msk                 /*!< EXTI2 GPIO port selection */
#define EXTI_EXTICR1_EXTI2_0      (0x1UL << EXTI_EXTICR1_EXTI2_Pos)      /*!< 0x00010000 */
#define EXTI_EXTICR1_EXTI2_1      (0x2UL << EXTI_EXTICR1_EXTI2_Pos)      /*!< 0x00020000 */
#define EXTI_EXTICR1_EXTI2_2      (0x4UL << EXTI_EXTICR1_EXTI2_Pos)      /*!< 0x00040000 */
#define EXTI_EXTICR1_EXTI2_3      (0x8UL << EXTI_EXTICR1_EXTI2_Pos)      /*!< 0x00080000 */
#define EXTI_EXTICR1_EXTI3_Pos    (24U)
#define EXTI_EXTICR1_EXTI3_Msk    (0xFFUL << EXTI_EXTICR1_EXTI3_Pos)     /*!< 0xFF000000 */
#define EXTI_EXTICR1_EXTI3        EXTI_EXTICR1_EXTI3_Msk                 /*!< EXTI3 GPIO port selection */
#define EXTI_EXTICR1_EXTI3_0      (0x1UL << EXTI_EXTICR1_EXTI3_Pos)      /*!< 0x01000000 */
#define EXTI_EXTICR1_EXTI3_1      (0x2UL << EXTI_EXTICR1_EXTI3_Pos)      /*!< 0x02000000 */
#define EXTI_EXTICR1_EXTI3_2      (0x4UL << EXTI_EXTICR1_EXTI3_Pos)      /*!< 0x04000000 */
#define EXTI_EXTICR1_EXTI3_3      (0x8UL << EXTI_EXTICR1_EXTI3_Pos)      /*!< 0x08000000 */

/* ***********************************  Bit definition for EXTI_EXTICR2 register  *********************************** */
#define EXTI_EXTICR2_EXTI4_Pos    (0U)
#define EXTI_EXTICR2_EXTI4_Msk    (0xFFUL << EXTI_EXTICR2_EXTI4_Pos)     /*!< 0x000000FF */
#define EXTI_EXTICR2_EXTI4        EXTI_EXTICR2_EXTI4_Msk                 /*!< EXTI4 GPIO port selection */
#define EXTI_EXTICR2_EXTI4_0      (0x1UL << EXTI_EXTICR2_EXTI4_Pos)      /*!< 0x00000001 */
#define EXTI_EXTICR2_EXTI4_1      (0x2UL << EXTI_EXTICR2_EXTI4_Pos)      /*!< 0x00000002 */
#define EXTI_EXTICR2_EXTI4_2      (0x4UL << EXTI_EXTICR2_EXTI4_Pos)      /*!< 0x00000004 */
#define EXTI_EXTICR2_EXTI4_3      (0x8UL << EXTI_EXTICR2_EXTI4_Pos)      /*!< 0x00000008 */
#define EXTI_EXTICR2_EXTI5_Pos    (8U)
#define EXTI_EXTICR2_EXTI5_Msk    (0xFFUL << EXTI_EXTICR2_EXTI5_Pos)     /*!< 0x0000FF00 */
#define EXTI_EXTICR2_EXTI5        EXTI_EXTICR2_EXTI5_Msk                 /*!< EXTI5 GPIO port selection */
#define EXTI_EXTICR2_EXTI5_0      (0x1UL << EXTI_EXTICR2_EXTI5_Pos)      /*!< 0x00000100 */
#define EXTI_EXTICR2_EXTI5_1      (0x2UL << EXTI_EXTICR2_EXTI5_Pos)      /*!< 0x00000200 */
#define EXTI_EXTICR2_EXTI5_2      (0x4UL << EXTI_EXTICR2_EXTI5_Pos)      /*!< 0x00000400 */
#define EXTI_EXTICR2_EXTI5_3      (0x8UL << EXTI_EXTICR2_EXTI5_Pos)      /*!< 0x00000800 */
#define EXTI_EXTICR2_EXTI6_Pos    (16U)
#define EXTI_EXTICR2_EXTI6_Msk    (0xFFUL << EXTI_EXTICR2_EXTI6_Pos)     /*!< 0x00FF0000 */
#define EXTI_EXTICR2_EXTI6        EXTI_EXTICR2_EXTI6_Msk                 /*!< EXTI6 GPIO port selection */
#define EXTI_EXTICR2_EXTI6_0      (0x1UL << EXTI_EXTICR2_EXTI6_Pos)      /*!< 0x00010000 */
#define EXTI_EXTICR2_EXTI6_1      (0x2UL << EXTI_EXTICR2_EXTI6_Pos)      /*!< 0x00020000 */
#define EXTI_EXTICR2_EXTI6_2      (0x4UL << EXTI_EXTICR2_EXTI6_Pos)      /*!< 0x00040000 */
#define EXTI_EXTICR2_EXTI6_3      (0x8UL << EXTI_EXTICR2_EXTI6_Pos)      /*!< 0x00080000 */
#define EXTI_EXTICR2_EXTI7_Pos    (24U)
#define EXTI_EXTICR2_EXTI7_Msk    (0xFFUL << EXTI_EXTICR2_EXTI7_Pos)     /*!< 0xFF000000 */
#define EXTI_EXTICR2_EXTI7        EXTI_EXTICR2_EXTI7_Msk                 /*!< EXTI7 GPIO port selection */
#define EXTI_EXTICR2_EXTI7_0      (0x1UL << EXTI_EXTICR2_EXTI7_Pos)      /*!< 0x01000000 */
#define EXTI_EXTICR2_EXTI7_1      (0x2UL << EXTI_EXTICR2_EXTI7_Pos)      /*!< 0x02000000 */
#define EXTI_EXTICR2_EXTI7_2      (0x4UL << EXTI_EXTICR2_EXTI7_Pos)      /*!< 0x04000000 */
#define EXTI_EXTICR2_EXTI7_3      (0x8UL << EXTI_EXTICR2_EXTI7_Pos)      /*!< 0x08000000 */

/* ***********************************  Bit definition for EXTI_EXTICR3 register  *********************************** */
#define EXTI_EXTICR3_EXTI8_Pos    (0U)
#define EXTI_EXTICR3_EXTI8_Msk    (0xFFUL << EXTI_EXTICR3_EXTI8_Pos)     /*!< 0x000000FF */
#define EXTI_EXTICR3_EXTI8        EXTI_EXTICR3_EXTI8_Msk                 /*!< EXTI8 GPIO port selection */
#define EXTI_EXTICR3_EXTI8_0      (0x1UL << EXTI_EXTICR3_EXTI8_Pos)      /*!< 0x00000001 */
#define EXTI_EXTICR3_EXTI8_1      (0x2UL << EXTI_EXTICR3_EXTI8_Pos)      /*!< 0x00000002 */
#define EXTI_EXTICR3_EXTI8_2      (0x4UL << EXTI_EXTICR3_EXTI8_Pos)      /*!< 0x00000004 */
#define EXTI_EXTICR3_EXTI8_3      (0x8UL << EXTI_EXTICR3_EXTI8_Pos)      /*!< 0x00000008 */
#define EXTI_EXTICR3_EXTI9_Pos    (8U)
#define EXTI_EXTICR3_EXTI9_Msk    (0xFFUL << EXTI_EXTICR3_EXTI9_Pos)     /*!< 0x0000FF00 */
#define EXTI_EXTICR3_EXTI9        EXTI_EXTICR3_EXTI9_Msk                 /*!< EXTI9 GPIO port selection */
#define EXTI_EXTICR3_EXTI9_0      (0x1UL << EXTI_EXTICR3_EXTI9_Pos)      /*!< 0x00000100 */
#define EXTI_EXTICR3_EXTI9_1      (0x2UL << EXTI_EXTICR3_EXTI9_Pos)      /*!< 0x00000200 */
#define EXTI_EXTICR3_EXTI9_2      (0x4UL << EXTI_EXTICR3_EXTI9_Pos)      /*!< 0x00000400 */
#define EXTI_EXTICR3_EXTI9_3      (0x8UL << EXTI_EXTICR3_EXTI9_Pos)      /*!< 0x00000800 */
#define EXTI_EXTICR3_EXTI10_Pos   (16U)
#define EXTI_EXTICR3_EXTI10_Msk   (0xFFUL << EXTI_EXTICR3_EXTI10_Pos)    /*!< 0x00FF0000 */
#define EXTI_EXTICR3_EXTI10       EXTI_EXTICR3_EXTI10_Msk                /*!< EXTI10 GPIO port selection */
#define EXTI_EXTICR3_EXTI10_0     (0x1UL << EXTI_EXTICR3_EXTI10_Pos)     /*!< 0x00010000 */
#define EXTI_EXTICR3_EXTI10_1     (0x2UL << EXTI_EXTICR3_EXTI10_Pos)     /*!< 0x00020000 */
#define EXTI_EXTICR3_EXTI10_2     (0x4UL << EXTI_EXTICR3_EXTI10_Pos)     /*!< 0x00040000 */
#define EXTI_EXTICR3_EXTI10_3     (0x8UL << EXTI_EXTICR3_EXTI10_Pos)     /*!< 0x00080000 */
#define EXTI_EXTICR3_EXTI11_Pos   (24U)
#define EXTI_EXTICR3_EXTI11_Msk   (0xFFUL << EXTI_EXTICR3_EXTI11_Pos)    /*!< 0xFF000000 */
#define EXTI_EXTICR3_EXTI11       EXTI_EXTICR3_EXTI11_Msk                /*!< EXTI11 GPIO port selection */
#define EXTI_EXTICR3_EXTI11_0     (0x1UL << EXTI_EXTICR3_EXTI11_Pos)     /*!< 0x01000000 */
#define EXTI_EXTICR3_EXTI11_1     (0x2UL << EXTI_EXTICR3_EXTI11_Pos)     /*!< 0x02000000 */
#define EXTI_EXTICR3_EXTI11_2     (0x4UL << EXTI_EXTICR3_EXTI11_Pos)     /*!< 0x04000000 */
#define EXTI_EXTICR3_EXTI11_3     (0x8UL << EXTI_EXTICR3_EXTI11_Pos)     /*!< 0x08000000 */

/* ***********************************  Bit definition for EXTI_EXTICR4 register  *********************************** */
#define EXTI_EXTICR4_EXTI12_Pos   (0U)
#define EXTI_EXTICR4_EXTI12_Msk   (0xFFUL << EXTI_EXTICR4_EXTI12_Pos)    /*!< 0x000000FF */
#define EXTI_EXTICR4_EXTI12       EXTI_EXTICR4_EXTI12_Msk                /*!< EXTI12 GPIO port selection */
#define EXTI_EXTICR4_EXTI12_0     (0x1UL << EXTI_EXTICR4_EXTI12_Pos)     /*!< 0x00000001 */
#define EXTI_EXTICR4_EXTI12_1     (0x2UL << EXTI_EXTICR4_EXTI12_Pos)     /*!< 0x00000002 */
#define EXTI_EXTICR4_EXTI12_2     (0x4UL << EXTI_EXTICR4_EXTI12_Pos)     /*!< 0x00000004 */
#define EXTI_EXTICR4_EXTI12_3     (0x8UL << EXTI_EXTICR4_EXTI12_Pos)     /*!< 0x00000008 */
#define EXTI_EXTICR4_EXTI13_Pos   (8U)
#define EXTI_EXTICR4_EXTI13_Msk   (0xFFUL << EXTI_EXTICR4_EXTI13_Pos)    /*!< 0x0000FF00 */
#define EXTI_EXTICR4_EXTI13       EXTI_EXTICR4_EXTI13_Msk                /*!< EXTI13 GPIO port selection */
#define EXTI_EXTICR4_EXTI13_0     (0x1UL << EXTI_EXTICR4_EXTI13_Pos)     /*!< 0x00000100 */
#define EXTI_EXTICR4_EXTI13_1     (0x2UL << EXTI_EXTICR4_EXTI13_Pos)     /*!< 0x00000200 */
#define EXTI_EXTICR4_EXTI13_2     (0x4UL << EXTI_EXTICR4_EXTI13_Pos)     /*!< 0x00000400 */
#define EXTI_EXTICR4_EXTI13_3     (0x8UL << EXTI_EXTICR4_EXTI13_Pos)     /*!< 0x00000800 */
#define EXTI_EXTICR4_EXTI14_Pos   (16U)
#define EXTI_EXTICR4_EXTI14_Msk   (0xFFUL << EXTI_EXTICR4_EXTI14_Pos)    /*!< 0x00FF0000 */
#define EXTI_EXTICR4_EXTI14       EXTI_EXTICR4_EXTI14_Msk                /*!< EXTI14 GPIO port selection */
#define EXTI_EXTICR4_EXTI14_0     (0x1UL << EXTI_EXTICR4_EXTI14_Pos)     /*!< 0x00010000 */
#define EXTI_EXTICR4_EXTI14_1     (0x2UL << EXTI_EXTICR4_EXTI14_Pos)     /*!< 0x00020000 */
#define EXTI_EXTICR4_EXTI14_2     (0x4UL << EXTI_EXTICR4_EXTI14_Pos)     /*!< 0x00040000 */
#define EXTI_EXTICR4_EXTI14_3     (0x8UL << EXTI_EXTICR4_EXTI14_Pos)     /*!< 0x00080000 */
#define EXTI_EXTICR4_EXTI15_Pos   (24U)
#define EXTI_EXTICR4_EXTI15_Msk   (0xFFUL << EXTI_EXTICR4_EXTI15_Pos)    /*!< 0xFF000000 */
#define EXTI_EXTICR4_EXTI15       EXTI_EXTICR4_EXTI15_Msk                /*!< EXTI15 GPIO port selection */
#define EXTI_EXTICR4_EXTI15_0     (0x1UL << EXTI_EXTICR4_EXTI15_Pos)     /*!< 0x01000000 */
#define EXTI_EXTICR4_EXTI15_1     (0x2UL << EXTI_EXTICR4_EXTI15_Pos)     /*!< 0x02000000 */
#define EXTI_EXTICR4_EXTI15_2     (0x4UL << EXTI_EXTICR4_EXTI15_Pos)     /*!< 0x04000000 */
#define EXTI_EXTICR4_EXTI15_3     (0x8UL << EXTI_EXTICR4_EXTI15_Pos)     /*!< 0x08000000 */

/* ************************************  Bit definition for EXTI_IMR1 register  ************************************* */
#define EXTI_IMR1_IM0_Pos         (0U)
#define EXTI_IMR1_IM0_Msk         (0x1UL << EXTI_IMR1_IM0_Pos)           /*!< 0x00000001 */
#define EXTI_IMR1_IM0             EXTI_IMR1_IM0_Msk                      /*!< CPU wake-up with interrupt mask on event
                                                                              input 0 */
#define EXTI_IMR1_IM1_Pos         (1U)
#define EXTI_IMR1_IM1_Msk         (0x1UL << EXTI_IMR1_IM1_Pos)           /*!< 0x00000002 */
#define EXTI_IMR1_IM1             EXTI_IMR1_IM1_Msk                      /*!< CPU wake-up with interrupt mask on event
                                                                              input 1 */
#define EXTI_IMR1_IM2_Pos         (2U)
#define EXTI_IMR1_IM2_Msk         (0x1UL << EXTI_IMR1_IM2_Pos)           /*!< 0x00000004 */
#define EXTI_IMR1_IM2             EXTI_IMR1_IM2_Msk                      /*!< CPU wake-up with interrupt mask on event
                                                                              input 2 */
#define EXTI_IMR1_IM3_Pos         (3U)
#define EXTI_IMR1_IM3_Msk         (0x1UL << EXTI_IMR1_IM3_Pos)           /*!< 0x00000008 */
#define EXTI_IMR1_IM3             EXTI_IMR1_IM3_Msk                      /*!< CPU wake-up with interrupt mask on event
                                                                              input 3 */
#define EXTI_IMR1_IM4_Pos         (4U)
#define EXTI_IMR1_IM4_Msk         (0x1UL << EXTI_IMR1_IM4_Pos)           /*!< 0x00000010 */
#define EXTI_IMR1_IM4             EXTI_IMR1_IM4_Msk                      /*!< CPU wake-up with interrupt mask on event
                                                                              input 4 */
#define EXTI_IMR1_IM5_Pos         (5U)
#define EXTI_IMR1_IM5_Msk         (0x1UL << EXTI_IMR1_IM5_Pos)           /*!< 0x00000020 */
#define EXTI_IMR1_IM5             EXTI_IMR1_IM5_Msk                      /*!< CPU wake-up with interrupt mask on event
                                                                              input 5 */
#define EXTI_IMR1_IM6_Pos         (6U)
#define EXTI_IMR1_IM6_Msk         (0x1UL << EXTI_IMR1_IM6_Pos)           /*!< 0x00000040 */
#define EXTI_IMR1_IM6             EXTI_IMR1_IM6_Msk                      /*!< CPU wake-up with interrupt mask on event
                                                                              input 6 */
#define EXTI_IMR1_IM7_Pos         (7U)
#define EXTI_IMR1_IM7_Msk         (0x1UL << EXTI_IMR1_IM7_Pos)           /*!< 0x00000080 */
#define EXTI_IMR1_IM7             EXTI_IMR1_IM7_Msk                      /*!< CPU wake-up with interrupt mask on event
                                                                              input 7 */
#define EXTI_IMR1_IM8_Pos         (8U)
#define EXTI_IMR1_IM8_Msk         (0x1UL << EXTI_IMR1_IM8_Pos)           /*!< 0x00000100 */
#define EXTI_IMR1_IM8             EXTI_IMR1_IM8_Msk                      /*!< CPU wake-up with interrupt mask on event
                                                                              input 8 */
#define EXTI_IMR1_IM9_Pos         (9U)
#define EXTI_IMR1_IM9_Msk         (0x1UL << EXTI_IMR1_IM9_Pos)           /*!< 0x00000200 */
#define EXTI_IMR1_IM9             EXTI_IMR1_IM9_Msk                      /*!< CPU wake-up with interrupt mask on event
                                                                              input 9 */
#define EXTI_IMR1_IM10_Pos        (10U)
#define EXTI_IMR1_IM10_Msk        (0x1UL << EXTI_IMR1_IM10_Pos)          /*!< 0x00000400 */
#define EXTI_IMR1_IM10            EXTI_IMR1_IM10_Msk                     /*!< CPU wake-up with interrupt mask on event
                                                                              input 10 */
#define EXTI_IMR1_IM11_Pos        (11U)
#define EXTI_IMR1_IM11_Msk        (0x1UL << EXTI_IMR1_IM11_Pos)          /*!< 0x00000800 */
#define EXTI_IMR1_IM11            EXTI_IMR1_IM11_Msk                     /*!< CPU wake-up with interrupt mask on event
                                                                              input 11 */
#define EXTI_IMR1_IM12_Pos        (12U)
#define EXTI_IMR1_IM12_Msk        (0x1UL << EXTI_IMR1_IM12_Pos)          /*!< 0x00001000 */
#define EXTI_IMR1_IM12            EXTI_IMR1_IM12_Msk                     /*!< CPU wake-up with interrupt mask on event
                                                                              input 12 */
#define EXTI_IMR1_IM13_Pos        (13U)
#define EXTI_IMR1_IM13_Msk        (0x1UL << EXTI_IMR1_IM13_Pos)          /*!< 0x00002000 */
#define EXTI_IMR1_IM13            EXTI_IMR1_IM13_Msk                     /*!< CPU wake-up with interrupt mask on event
                                                                              input 13 */
#define EXTI_IMR1_IM14_Pos        (14U)
#define EXTI_IMR1_IM14_Msk        (0x1UL << EXTI_IMR1_IM14_Pos)          /*!< 0x00004000 */
#define EXTI_IMR1_IM14            EXTI_IMR1_IM14_Msk                     /*!< CPU wake-up with interrupt mask on event
                                                                              input 14 */
#define EXTI_IMR1_IM15_Pos        (15U)
#define EXTI_IMR1_IM15_Msk        (0x1UL << EXTI_IMR1_IM15_Pos)          /*!< 0x00008000 */
#define EXTI_IMR1_IM15            EXTI_IMR1_IM15_Msk                     /*!< CPU wake-up with interrupt mask on event
                                                                              input 15 */
#define EXTI_IMR1_IM16_Pos        (16U)
#define EXTI_IMR1_IM16_Msk        (0x1UL << EXTI_IMR1_IM16_Pos)          /*!< 0x00010000 */
#define EXTI_IMR1_IM16            EXTI_IMR1_IM16_Msk                     /*!< CPU wake-up with interrupt mask on event
                                                                              input 16 */
#define EXTI_IMR1_IM17_Pos        (17U)
#define EXTI_IMR1_IM17_Msk        (0x1UL << EXTI_IMR1_IM17_Pos)          /*!< 0x00020000 */
#define EXTI_IMR1_IM17            EXTI_IMR1_IM17_Msk                     /*!< CPU wake-up with interrupt mask on event
                                                                              input 17 */
#define EXTI_IMR1_IM18_Pos        (18U)
#define EXTI_IMR1_IM18_Msk        (0x1UL << EXTI_IMR1_IM18_Pos)          /*!< 0x00040000 */
#define EXTI_IMR1_IM18            EXTI_IMR1_IM18_Msk                     /*!< CPU wake-up with interrupt mask on event
                                                                              input 18 */
#define EXTI_IMR1_IM19_Pos        (19U)
#define EXTI_IMR1_IM19_Msk        (0x1UL << EXTI_IMR1_IM19_Pos)          /*!< 0x00080000 */
#define EXTI_IMR1_IM19            EXTI_IMR1_IM19_Msk                     /*!< CPU wake-up with interrupt mask on event
                                                                              input 19 */
#define EXTI_IMR1_IM20_Pos        (20U)
#define EXTI_IMR1_IM20_Msk        (0x1UL << EXTI_IMR1_IM20_Pos)          /*!< 0x00100000 */
#define EXTI_IMR1_IM20            EXTI_IMR1_IM20_Msk                     /*!< CPU wake-up with interrupt mask on event
                                                                              input 20 */
#define EXTI_IMR1_IM21_Pos        (21U)
#define EXTI_IMR1_IM21_Msk        (0x1UL << EXTI_IMR1_IM21_Pos)          /*!< 0x00200000 */
#define EXTI_IMR1_IM21            EXTI_IMR1_IM21_Msk                     /*!< CPU wake-up with interrupt mask on event
                                                                              input 21 */
#define EXTI_IMR1_IM22_Pos        (22U)
#define EXTI_IMR1_IM22_Msk        (0x1UL << EXTI_IMR1_IM22_Pos)          /*!< 0x00400000 */
#define EXTI_IMR1_IM22            EXTI_IMR1_IM22_Msk                     /*!< CPU wake-up with interrupt mask on event
                                                                              input 22 */
#define EXTI_IMR1_IM23_Pos        (23U)
#define EXTI_IMR1_IM23_Msk        (0x1UL << EXTI_IMR1_IM23_Pos)          /*!< 0x00800000 */
#define EXTI_IMR1_IM23            EXTI_IMR1_IM23_Msk                     /*!< CPU wake-up with interrupt mask on event
                                                                              input 23 */
#define EXTI_IMR1_IM24_Pos        (24U)
#define EXTI_IMR1_IM24_Msk        (0x1UL << EXTI_IMR1_IM24_Pos)          /*!< 0x01000000 */
#define EXTI_IMR1_IM24            EXTI_IMR1_IM24_Msk                     /*!< CPU wake-up with interrupt mask on event
                                                                              input 24 */
#define EXTI_IMR1_IM25_Pos        (25U)
#define EXTI_IMR1_IM25_Msk        (0x1UL << EXTI_IMR1_IM25_Pos)          /*!< 0x02000000 */
#define EXTI_IMR1_IM25            EXTI_IMR1_IM25_Msk                     /*!< CPU wake-up with interrupt mask on event
                                                                              input 25 */
#define EXTI_IMR1_IM26_Pos        (26U)
#define EXTI_IMR1_IM26_Msk        (0x1UL << EXTI_IMR1_IM26_Pos)          /*!< 0x04000000 */
#define EXTI_IMR1_IM26            EXTI_IMR1_IM26_Msk                     /*!< CPU wake-up with interrupt mask on event
                                                                              input 26 */
#define EXTI_IMR1_IM27_Pos        (27U)
#define EXTI_IMR1_IM27_Msk        (0x1UL << EXTI_IMR1_IM27_Pos)          /*!< 0x08000000 */
#define EXTI_IMR1_IM27            EXTI_IMR1_IM27_Msk                     /*!< CPU wake-up with interrupt mask on event
                                                                              input 27 */
#define EXTI_IMR1_IM28_Pos        (28U)
#define EXTI_IMR1_IM28_Msk        (0x1UL << EXTI_IMR1_IM28_Pos)          /*!< 0x10000000 */
#define EXTI_IMR1_IM28            EXTI_IMR1_IM28_Msk                     /*!< CPU wake-up with interrupt mask on event
                                                                              input 28 */
#define EXTI_IMR1_IM29_Pos        (29U)
#define EXTI_IMR1_IM29_Msk        (0x1UL << EXTI_IMR1_IM29_Pos)          /*!< 0x20000000 */
#define EXTI_IMR1_IM29            EXTI_IMR1_IM29_Msk                     /*!< CPU wake-up with interrupt mask on event
                                                                              input 29 */
#define EXTI_IMR1_IM30_Pos        (30U)
#define EXTI_IMR1_IM30_Msk        (0x1UL << EXTI_IMR1_IM30_Pos)          /*!< 0x40000000 */
#define EXTI_IMR1_IM30            EXTI_IMR1_IM30_Msk                     /*!< CPU wake-up with interrupt mask on event
                                                                              input 30 */
#define EXTI_IMR1_IM31_Pos        (31U)
#define EXTI_IMR1_IM31_Msk        (0x1UL << EXTI_IMR1_IM31_Pos)          /*!< 0x80000000 */
#define EXTI_IMR1_IM31            EXTI_IMR1_IM31_Msk                     /*!< CPU wake-up with interrupt mask on event
                                                                              input 31 */

