MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c552xx.h
/* **********************************  Bit definition for FLASH_OPTKEYR register  *********************************** */
#define FLASH_OPTKEYR_OPTKEY_Pos            (0U)
#define FLASH_OPTKEYR_OPTKEY_Msk            (0xFFFFFFFFUL << FLASH_OPTKEYR_OPTKEY_Pos)       /*!< 0xFFFFFFFF */
#define FLASH_OPTKEYR_OPTKEY                FLASH_OPTKEYR_OPTKEY_Msk                         /*!< FLASH option-byte
                                                                                                  control access unlock
                                                                                                  key */

/* ************************************  Bit definition for FLASH_OPSR register  ************************************ */
#define FLASH_OPSR_ADDR_OP_Pos              (0U)
#define FLASH_OPSR_ADDR_OP_Msk              (0xFFFFUL << FLASH_OPSR_ADDR_OP_Pos)             /*!< 0x0000FFFF */
#define FLASH_OPSR_ADDR_OP                  FLASH_OPSR_ADDR_OP_Msk                           /*!< Interrupted operation
                                                                                                  address */
#define FLASH_OPSR_DATA_OP_Pos              (21U)
#define FLASH_OPSR_DATA_OP_Msk              (0x1UL << FLASH_OPSR_DATA_OP_Pos)                /*!< 0x00200000 */
#define FLASH_OPSR_DATA_OP                  FLASH_OPSR_DATA_OP_Msk                           /*!< Flash data area
                                                                                                  operation interrupted
                                                                                                  */
#define FLASH_OPSR_BK_OP_Pos                (22U)
#define FLASH_OPSR_BK_OP_Msk                (0x1UL << FLASH_OPSR_BK_OP_Pos)                  /*!< 0x00400000 */
#define FLASH_OPSR_BK_OP                    FLASH_OPSR_BK_OP_Msk                             /*!< Interrupted operation
                                                                                                  bank */
#define FLASH_OPSR_OTP_OP_Pos               (24U)
#define FLASH_OPSR_OTP_OP_Msk               (0x1UL << FLASH_OPSR_OTP_OP_Pos)                 /*!< 0x01000000 */
#define FLASH_OPSR_OTP_OP                   FLASH_OPSR_OTP_OP_Msk                            /*!< OTP operation
                                                                                                  interrupted */
#define FLASH_OPSR_CODE_OP_Pos              (29U)
#define FLASH_OPSR_CODE_OP_Msk              (0x7UL << FLASH_OPSR_CODE_OP_Pos)                /*!< 0xE0000000 */
#define FLASH_OPSR_CODE_OP                  FLASH_OPSR_CODE_OP_Msk                           /*!< Flash memory operation
                                                                                                  code */
#define FLASH_OPSR_CODE_OP_0                (0x1UL << FLASH_OPSR_CODE_OP_Pos)                /*!< 0x20000000 */
#define FLASH_OPSR_CODE_OP_1                (0x2UL << FLASH_OPSR_CODE_OP_Pos)                /*!< 0x40000000 */
#define FLASH_OPSR_CODE_OP_2                (0x4UL << FLASH_OPSR_CODE_OP_Pos)                /*!< 0x80000000 */

/* ***********************************  Bit definition for FLASH_OPTCR register  ************************************ */
#define FLASH_OPTCR_OPTLOCK_Pos             (0U)
#define FLASH_OPTCR_OPTLOCK_Msk             (0x1UL << FLASH_OPTCR_OPTLOCK_Pos)               /*!< 0x00000001 */
#define FLASH_OPTCR_OPTLOCK                 FLASH_OPTCR_OPTLOCK_Msk                          /*!< FLASH_OPTCR lock
                                                                                                  option configuration
                                                                                                  bit */
#define FLASH_OPTCR_OPTSTRT_Pos             (1U)
#define FLASH_OPTCR_OPTSTRT_Msk             (0x1UL << FLASH_OPTCR_OPTSTRT_Pos)               /*!< 0x00000002 */
#define FLASH_OPTCR_OPTSTRT                 FLASH_OPTCR_OPTSTRT_Msk                          /*!< Option-byte start
                                                                                                  change option
                                                                                                  configuration bit */
#define FLASH_OPTCR_SWAP_BANK_Pos           (31U)
#define FLASH_OPTCR_SWAP_BANK_Msk           (0x1UL << FLASH_OPTCR_SWAP_BANK_Pos)             /*!< 0x80000000 */
#define FLASH_OPTCR_SWAP_BANK               FLASH_OPTCR_SWAP_BANK_Msk                        /*!< Bank swapping option
                                                                                                  configuration bit */

/* *************************************  Bit definition for FLASH_SR register  ************************************* */
#define FLASH_SR_BSY_Pos                    (0U)
#define FLASH_SR_BSY_Msk                    (0x1UL << FLASH_SR_BSY_Pos)                      /*!< 0x00000001 */
#define FLASH_SR_BSY                        FLASH_SR_BSY_Msk                                 /*!< busy flag */
#define FLASH_SR_WBNE_Pos                   (1U)
#define FLASH_SR_WBNE_Msk                   (0x1UL << FLASH_SR_WBNE_Pos)                     /*!< 0x00000002 */
#define FLASH_SR_WBNE                       FLASH_SR_WBNE_Msk                                /*!< write buffer not empty
                                                                                                  flag */
#define FLASH_SR_DBNE_Pos                   (3U)
#define FLASH_SR_DBNE_Msk                   (0x1UL << FLASH_SR_DBNE_Pos)                     /*!< 0x00000008 */
#define FLASH_SR_DBNE                       FLASH_SR_DBNE_Msk                                /*!< data buffer not empty
                                                                                                  flag */
#define FLASH_SR_OEMLOCK_Pos                (8U)
#define FLASH_SR_OEMLOCK_Msk                (0x1UL << FLASH_SR_OEMLOCK_Pos)                  /*!< 0x00000100 */
#define FLASH_SR_OEMLOCK                    FLASH_SR_OEMLOCK_Msk                             /*!< OEM lock */
#define FLASH_SR_BSLOCK_Pos                 (9U)
#define FLASH_SR_BSLOCK_Msk                 (0x1UL << FLASH_SR_BSLOCK_Pos)                   /*!< 0x00000200 */
#define FLASH_SR_BSLOCK                     FLASH_SR_BSLOCK_Msk                              /*!< BS lock */
#define FLASH_SR_EOP_Pos                    (16U)
#define FLASH_SR_EOP_Msk                    (0x1UL << FLASH_SR_EOP_Pos)                      /*!< 0x00010000 */
#define FLASH_SR_EOP                        FLASH_SR_EOP_Msk                                 /*!< end of operation flag
                                                                                                  */
#define FLASH_SR_WRPERR_Pos                 (17U)
#define FLASH_SR_WRPERR_Msk                 (0x1UL << FLASH_SR_WRPERR_Pos)                   /*!< 0x00020000 */
#define FLASH_SR_WRPERR                     FLASH_SR_WRPERR_Msk                              /*!< write protection error
                                                                                                  flag */
#define FLASH_SR_PGSERR_Pos                 (18U)
#define FLASH_SR_PGSERR_Msk                 (0x1UL << FLASH_SR_PGSERR_Pos)                   /*!< 0x00040000 */
#define FLASH_SR_PGSERR                     FLASH_SR_PGSERR_Msk                              /*!< programming sequence
                                                                                                  error flag */
#define FLASH_SR_STRBERR_Pos                (19U)
#define FLASH_SR_STRBERR_Msk                (0x1UL << FLASH_SR_STRBERR_Pos)                  /*!< 0x00080000 */
#define FLASH_SR_STRBERR                    FLASH_SR_STRBERR_Msk                             /*!< strobe error flag */
#define FLASH_SR_INCERR_Pos                 (20U)
#define FLASH_SR_INCERR_Msk                 (0x1UL << FLASH_SR_INCERR_Pos)                   /*!< 0x00100000 */
#define FLASH_SR_INCERR                     FLASH_SR_INCERR_Msk                              /*!< Inconsistency error
                                                                                                  flag */
#define FLASH_SR_OPTCHANGEERR_Pos           (23U)
#define FLASH_SR_OPTCHANGEERR_Msk           (0x1UL << FLASH_SR_OPTCHANGEERR_Pos)             /*!< 0x00800000 */
#define FLASH_SR_OPTCHANGEERR               FLASH_SR_OPTCHANGEERR_Msk                        /*!< Option-byte change
                                                                                                  error flag */

