MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c552xx.h
/* *********************************  Bit definition for FLASH_BOOTR_PRG register  ********************************** */
#define FLASH_BOOTR_PRG_BOOT_LOCK_Pos       (0U)
#define FLASH_BOOTR_PRG_BOOT_LOCK_Msk       (0xFFUL << FLASH_BOOTR_PRG_BOOT_LOCK_Pos)        /*!< 0x000000FF */
#define FLASH_BOOTR_PRG_BOOT_LOCK           FLASH_BOOTR_PRG_BOOT_LOCK_Msk                    /*!< A field locking the
                                                                                                  values of BOOT0,
                                                                                                  BOOT_SEL, SWAP_BANK,
                                                                                                  and BOOTADD option
                                                                                                  settings. */
#define FLASH_BOOTR_PRG_BOOTADD_Pos         (8U)
#define FLASH_BOOTR_PRG_BOOTADD_Msk         (0xFFFFFFUL << FLASH_BOOTR_PRG_BOOTADD_Pos)      /*!< 0xFFFFFF00 */
#define FLASH_BOOTR_PRG_BOOTADD             FLASH_BOOTR_PRG_BOOTADD_Msk                      /*!< unique boot entry
                                                                                                  address */

/* *********************************  Bit definition for FLASH_OTPBLR_CUR register  ********************************* */
#define FLASH_OTPBLR_CUR_LOCKBL_Pos         (0U)
#define FLASH_OTPBLR_CUR_LOCKBL_Msk         (0xFFFFFFUL << FLASH_OTPBLR_CUR_LOCKBL_Pos)      /*!< 0x00FFFFFF */
#define FLASH_OTPBLR_CUR_LOCKBL             FLASH_OTPBLR_CUR_LOCKBL_Msk                      /*!< OTP block lock */

/* *********************************  Bit definition for FLASH_OTPBLR_PRG register  ********************************* */
#define FLASH_OTPBLR_PRG_LOCKBL_Pos         (0U)
#define FLASH_OTPBLR_PRG_LOCKBL_Msk         (0xFFFFFFUL << FLASH_OTPBLR_PRG_LOCKBL_Pos)      /*!< 0x00FFFFFF */
#define FLASH_OTPBLR_PRG_LOCKBL             FLASH_OTPBLR_PRG_LOCKBL_Msk                      /*!< OTP block lock */

/* *******************************  Bit definition for FLASH_BL_COM_CFG_CUR register  ******************************* */
#define FLASH_BL_COM_CFG_CUR_BL_COM_CFG_Pos (0U)
#define FLASH_BL_COM_CFG_CUR_BL_COM_CFG_Msk (0xFFFFFFFFUL << \
                                            FLASH_BL_COM_CFG_CUR_BL_COM_CFG_Pos)             /*!< 0xFFFFFFFF */
#define FLASH_BL_COM_CFG_CUR_BL_COM_CFG     FLASH_BL_COM_CFG_CUR_BL_COM_CFG_Msk              /*!< Bootloader interface
                                                                                                  selection/configuratio
                                                                                                  n */

/* *******************************  Bit definition for FLASH_BL_COM_CFG_PRG register  ******************************* */
#define FLASH_BL_COM_CFG_PRG_BL_COM_CFG_Pos (0U)
#define FLASH_BL_COM_CFG_PRG_BL_COM_CFG_Msk (0xFFFFFFFFUL << \
                                            FLASH_BL_COM_CFG_PRG_BL_COM_CFG_Pos)             /*!< 0xFFFFFFFF */
#define FLASH_BL_COM_CFG_PRG_BL_COM_CFG     FLASH_BL_COM_CFG_PRG_BL_COM_CFG_Msk              /*!< Bootloader interface
                                                                                                  selection/configuratio
                                                                                                  n */

/* ********************************  Bit definition for FLASH_OEMKEYR1_PRG register  ******************************** */
#define FLASH_OEMKEYR1_PRG_OEMKEY_Pos       (0U)
#define FLASH_OEMKEYR1_PRG_OEMKEY_Msk       (0xFFFFFFFFUL << FLASH_OEMKEYR1_PRG_OEMKEY_Pos)  /*!< 0xFFFFFFFF */
#define FLASH_OEMKEYR1_PRG_OEMKEY           FLASH_OEMKEYR1_PRG_OEMKEY_Msk                    /*!< Least significants
                                                                                                  bytes of OEMKEY */

/* ********************************  Bit definition for FLASH_OEMKEYR2_PRG register  ******************************** */
#define FLASH_OEMKEYR2_PRG_OEMKEY_Pos       (0U)
#define FLASH_OEMKEYR2_PRG_OEMKEY_Msk       (0xFFFFFFFFUL << FLASH_OEMKEYR2_PRG_OEMKEY_Pos)  /*!< 0xFFFFFFFF */
#define FLASH_OEMKEYR2_PRG_OEMKEY           FLASH_OEMKEYR2_PRG_OEMKEY_Msk                    /*!< Mid-least significants
                                                                                                  bytes of OEMKEY */

/* ********************************  Bit definition for FLASH_OEMKEYR3_PRG register  ******************************** */
#define FLASH_OEMKEYR3_PRG_OEMKEY_Pos       (0U)
#define FLASH_OEMKEYR3_PRG_OEMKEY_Msk       (0xFFFFFFFFUL << FLASH_OEMKEYR3_PRG_OEMKEY_Pos)  /*!< 0xFFFFFFFF */
#define FLASH_OEMKEYR3_PRG_OEMKEY           FLASH_OEMKEYR3_PRG_OEMKEY_Msk                    /*!< Mid-most significants
                                                                                                  bytes of OEMKEY */

/* ********************************  Bit definition for FLASH_OEMKEYR4_PRG register  ******************************** */
#define FLASH_OEMKEYR4_PRG_OEMKEY_Pos       (0U)
#define FLASH_OEMKEYR4_PRG_OEMKEY_Msk       (0xFFFFFFFFUL << FLASH_OEMKEYR4_PRG_OEMKEY_Pos)  /*!< 0xFFFFFFFF */
#define FLASH_OEMKEYR4_PRG_OEMKEY           FLASH_OEMKEYR4_PRG_OEMKEY_Msk                    /*!< Most significants
                                                                                                  bytes of OEMKEY */

/* *********************************  Bit definition for FLASH_BSKEYR_PRG register  ********************************* */
#define FLASH_BSKEYR_PRG_BSKEY_Pos          (0U)
#define FLASH_BSKEYR_PRG_BSKEY_Msk          (0xFFFFFFFFUL << FLASH_BSKEYR_PRG_BSKEY_Pos)     /*!< 0xFFFFFFFF */
#define FLASH_BSKEYR_PRG_BSKEY              FLASH_BSKEYR_PRG_BSKEY_Msk                       /*!< Boundary Scan KEY */

/* *********************************  Bit definition for FLASH_WRP1R_CUR register  ********************************** */
#define FLASH_WRP1R_CUR_WRPSG1_Pos          (0U)
#define FLASH_WRP1R_CUR_WRPSG1_Msk          (0xFFFFFFFFUL << FLASH_WRP1R_CUR_WRPSG1_Pos)     /*!< 0xFFFFFFFF */
#define FLASH_WRP1R_CUR_WRPSG1              FLASH_WRP1R_CUR_WRPSG1_Msk                       /*!< Bank1 page protection
                                                                                                  option status byte */

/* *********************************  Bit definition for FLASH_WRP1R_PRG register  ********************************** */
#define FLASH_WRP1R_PRG_WRPSG1_Pos          (0U)
#define FLASH_WRP1R_PRG_WRPSG1_Msk          (0xFFFFFFFFUL << FLASH_WRP1R_PRG_WRPSG1_Pos)     /*!< 0xFFFFFFFF */
#define FLASH_WRP1R_PRG_WRPSG1              FLASH_WRP1R_PRG_WRPSG1_Msk                       /*!< Bank1 page protection
                                                                                                  option status byte */

/* *********************************  Bit definition for FLASH_HDP1R_CUR register  ********************************** */
#define FLASH_HDP1R_CUR_HDP1_STRT_Pos       (0U)
#define FLASH_HDP1R_CUR_HDP1_STRT_Msk       (0x3FUL << FLASH_HDP1R_CUR_HDP1_STRT_Pos)        /*!< 0x0000003F */
#define FLASH_HDP1R_CUR_HDP1_STRT           FLASH_HDP1R_CUR_HDP1_STRT_Msk                    /*!< HDPL barrier
                                                                                                  start set in
                                                                                                  number of 8
                                                                                                  Kbytes pages */
#define FLASH_HDP1R_CUR_HDP1_END_Pos        (16U)
#define FLASH_HDP1R_CUR_HDP1_END_Msk        (0x3FUL << FLASH_HDP1R_CUR_HDP1_END_Pos)         /*!< 0x003F0000 */
#define FLASH_HDP1R_CUR_HDP1_END            FLASH_HDP1R_CUR_HDP1_END_Msk                     /*!< HDPL barrier
                                                                                                   end set in
                                                                                                   number of 8
                                                                                                   Kbytes pages */

/* *********************************  Bit definition for FLASH_HDP1R_PRG register  ********************************** */
#define FLASH_HDP1R_PRG_HDP1_STRT_Pos       (0U)
#define FLASH_HDP1R_PRG_HDP1_STRT_Msk       (0x3FUL << FLASH_HDP1R_PRG_HDP1_STRT_Pos)        /*!< 0x0000003F */
#define FLASH_HDP1R_PRG_HDP1_STRT           FLASH_HDP1R_PRG_HDP1_STRT_Msk                    /*!< Bank 1 HDPL barrier
                                                                                                  start set in number of
                                                                                                  8 Kbytes pages */
#define FLASH_HDP1R_PRG_HDP1_END_Pos        (16U)
#define FLASH_HDP1R_PRG_HDP1_END_Msk        (0x3FUL << FLASH_HDP1R_PRG_HDP1_END_Pos)         /*!< 0x003F0000 */
#define FLASH_HDP1R_PRG_HDP1_END            FLASH_HDP1R_PRG_HDP1_END_Msk                     /*!< Bank 1 HDPL barrier
                                                                                                  end set in number of
                                                                                                  8 Kbytes pages */

