MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c552xx.h
/* **********************************   Bit definition for RAMCFG_WPR2 register   *********************************** */
#define RAMCFG_WPR2_P32WP_Pos      (0U)
#define RAMCFG_WPR2_P32WP_Msk      (0x1UL << RAMCFG_WPR2_P32WP_Pos)        /*!< 0x00000001 */
#define RAMCFG_WPR2_P32WP          RAMCFG_WPR2_P32WP_Msk                   /*!< Write Protection Page 32 */
#define RAMCFG_WPR2_P33WP_Pos      (1U)
#define RAMCFG_WPR2_P33WP_Msk      (0x1UL << RAMCFG_WPR2_P33WP_Pos)        /*!< 0x00000002 */
#define RAMCFG_WPR2_P33WP          RAMCFG_WPR2_P33WP_Msk                   /*!< Write Protection Page 33 */
#define RAMCFG_WPR2_P34WP_Pos      (2U)
#define RAMCFG_WPR2_P34WP_Msk      (0x1UL << RAMCFG_WPR2_P34WP_Pos)        /*!< 0x00000004 */
#define RAMCFG_WPR2_P34WP          RAMCFG_WPR2_P34WP_Msk                   /*!< Write Protection Page 34 */
#define RAMCFG_WPR2_P35WP_Pos      (3U)
#define RAMCFG_WPR2_P35WP_Msk      (0x1UL << RAMCFG_WPR2_P35WP_Pos)        /*!< 0x00000008 */
#define RAMCFG_WPR2_P35WP          RAMCFG_WPR2_P35WP_Msk                   /*!< Write Protection Page 35 */
#define RAMCFG_WPR2_P36WP_Pos      (4U)
#define RAMCFG_WPR2_P36WP_Msk      (0x1UL << RAMCFG_WPR2_P36WP_Pos)        /*!< 0x00000010 */
#define RAMCFG_WPR2_P36WP          RAMCFG_WPR2_P36WP_Msk                   /*!< Write Protection Page 36 */
#define RAMCFG_WPR2_P37WP_Pos      (5U)
#define RAMCFG_WPR2_P37WP_Msk      (0x1UL << RAMCFG_WPR2_P37WP_Pos)        /*!< 0x00000020 */
#define RAMCFG_WPR2_P37WP          RAMCFG_WPR2_P37WP_Msk                   /*!< Write Protection Page 37 */
#define RAMCFG_WPR2_P38WP_Pos      (6U)
#define RAMCFG_WPR2_P38WP_Msk      (0x1UL << RAMCFG_WPR2_P38WP_Pos)        /*!< 0x00000040 */
#define RAMCFG_WPR2_P38WP          RAMCFG_WPR2_P38WP_Msk                   /*!< Write Protection Page 38 */
#define RAMCFG_WPR2_P39WP_Pos      (7U)
#define RAMCFG_WPR2_P39WP_Msk      (0x1UL << RAMCFG_WPR2_P39WP_Pos)        /*!< 0x00000080 */
#define RAMCFG_WPR2_P39WP          RAMCFG_WPR2_P39WP_Msk                   /*!< Write Protection Page 39 */
#define RAMCFG_WPR2_P40WP_Pos      (8U)
#define RAMCFG_WPR2_P40WP_Msk      (0x1UL << RAMCFG_WPR2_P40WP_Pos)        /*!< 0x00000100 */
#define RAMCFG_WPR2_P40WP          RAMCFG_WPR2_P40WP_Msk                   /*!< Write Protection Page 40 */
#define RAMCFG_WPR2_P41WP_Pos      (9U)
#define RAMCFG_WPR2_P41WP_Msk      (0x1UL << RAMCFG_WPR2_P41WP_Pos)        /*!< 0x00000200 */
#define RAMCFG_WPR2_P41WP          RAMCFG_WPR2_P41WP_Msk                   /*!< Write Protection Page 41 */
#define RAMCFG_WPR2_P42WP_Pos      (10U)
#define RAMCFG_WPR2_P42WP_Msk      (0x1UL << RAMCFG_WPR2_P42WP_Pos)        /*!< 0x00000400 */
#define RAMCFG_WPR2_P42WP          RAMCFG_WPR2_P42WP_Msk                   /*!< Write Protection Page 42 */
#define RAMCFG_WPR2_P43WP_Pos      (11U)
#define RAMCFG_WPR2_P43WP_Msk      (0x1UL << RAMCFG_WPR2_P43WP_Pos)        /*!< 0x00000800 */
#define RAMCFG_WPR2_P43WP          RAMCFG_WPR2_P43WP_Msk                   /*!< Write Protection Page 43 */
#define RAMCFG_WPR2_P44WP_Pos      (12U)
#define RAMCFG_WPR2_P44WP_Msk      (0x1UL << RAMCFG_WPR2_P44WP_Pos)        /*!< 0x00001000 */
#define RAMCFG_WPR2_P44WP          RAMCFG_WPR2_P44WP_Msk                   /*!< Write Protection Page 44 */
#define RAMCFG_WPR2_P45WP_Pos      (13U)
#define RAMCFG_WPR2_P45WP_Msk      (0x1UL << RAMCFG_WPR2_P45WP_Pos)        /*!< 0x00002000 */
#define RAMCFG_WPR2_P45WP          RAMCFG_WPR2_P45WP_Msk                   /*!< Write Protection Page 45 */
#define RAMCFG_WPR2_P46WP_Pos      (14U)
#define RAMCFG_WPR2_P46WP_Msk      (0x1UL << RAMCFG_WPR2_P46WP_Pos)        /*!< 0x00004000 */
#define RAMCFG_WPR2_P46WP          RAMCFG_WPR2_P46WP_Msk                   /*!< Write Protection Page 46 */
#define RAMCFG_WPR2_P47WP_Pos      (15U)
#define RAMCFG_WPR2_P47WP_Msk      (0x1UL << RAMCFG_WPR2_P47WP_Pos)        /*!< 0x00008000 */
#define RAMCFG_WPR2_P47WP          RAMCFG_WPR2_P47WP_Msk                   /*!< Write Protection Page 47 */
#define RAMCFG_WPR2_P48WP_Pos      (16U)
#define RAMCFG_WPR2_P48WP_Msk      (0x1UL << RAMCFG_WPR2_P48WP_Pos)        /*!< 0x00010000 */
#define RAMCFG_WPR2_P48WP          RAMCFG_WPR2_P48WP_Msk                   /*!< Write Protection Page 48 */
#define RAMCFG_WPR2_P49WP_Pos      (17U)
#define RAMCFG_WPR2_P49WP_Msk      (0x1UL << RAMCFG_WPR2_P49WP_Pos)        /*!< 0x00020000 */
#define RAMCFG_WPR2_P49WP          RAMCFG_WPR2_P49WP_Msk                   /*!< Write Protection Page 49 */
#define RAMCFG_WPR2_P50WP_Pos      (18U)
#define RAMCFG_WPR2_P50WP_Msk      (0x1UL << RAMCFG_WPR2_P50WP_Pos)        /*!< 0x00040000 */
#define RAMCFG_WPR2_P50WP          RAMCFG_WPR2_P50WP_Msk                   /*!< Write Protection Page 50 */
#define RAMCFG_WPR2_P51WP_Pos      (19U)
#define RAMCFG_WPR2_P51WP_Msk      (0x1UL << RAMCFG_WPR2_P51WP_Pos)        /*!< 0x00080000 */
#define RAMCFG_WPR2_P51WP          RAMCFG_WPR2_P51WP_Msk                   /*!< Write Protection Page 51 */
#define RAMCFG_WPR2_P52WP_Pos      (20U)
#define RAMCFG_WPR2_P52WP_Msk      (0x1UL << RAMCFG_WPR2_P52WP_Pos)        /*!< 0x00100000 */
#define RAMCFG_WPR2_P52WP          RAMCFG_WPR2_P52WP_Msk                   /*!< Write Protection Page 52 */
#define RAMCFG_WPR2_P53WP_Pos      (21U)
#define RAMCFG_WPR2_P53WP_Msk      (0x1UL << RAMCFG_WPR2_P53WP_Pos)        /*!< 0x00200000 */
#define RAMCFG_WPR2_P53WP          RAMCFG_WPR2_P53WP_Msk                   /*!< Write Protection Page 53 */
#define RAMCFG_WPR2_P54WP_Pos      (22U)
#define RAMCFG_WPR2_P54WP_Msk      (0x1UL << RAMCFG_WPR2_P54WP_Pos)        /*!< 0x00400000 */
#define RAMCFG_WPR2_P54WP          RAMCFG_WPR2_P54WP_Msk                   /*!< Write Protection Page 54 */
#define RAMCFG_WPR2_P55WP_Pos      (23U)
#define RAMCFG_WPR2_P55WP_Msk      (0x1UL << RAMCFG_WPR2_P55WP_Pos)        /*!< 0x00800000 */
#define RAMCFG_WPR2_P55WP          RAMCFG_WPR2_P55WP_Msk                   /*!< Write Protection Page 55 */
#define RAMCFG_WPR2_P56WP_Pos      (25U)
#define RAMCFG_WPR2_P56WP_Msk      (0x1UL << RAMCFG_WPR2_P56WP_Pos)        /*!< 0x01000000 */
#define RAMCFG_WPR2_P56WP          RAMCFG_WPR2_P56WP_Msk                   /*!< Write Protection Page 56 */
#define RAMCFG_WPR2_P57WP_Pos      (26U)
#define RAMCFG_WPR2_P57WP_Msk      (0x1UL << RAMCFG_WPR2_P57WP_Pos)        /*!< 0x02000000 */
#define RAMCFG_WPR2_P57WP          RAMCFG_WPR2_P57WP_Msk                   /*!< Write Protection Page 57 */
#define RAMCFG_WPR2_P58WP_Pos      (27U)
#define RAMCFG_WPR2_P58WP_Msk      (0x1UL << RAMCFG_WPR2_P58WP_Pos)        /*!< 0x04000000 */
#define RAMCFG_WPR2_P58WP          RAMCFG_WPR2_P58WP_Msk                   /*!< Write Protection Page 58 */
#define RAMCFG_WPR2_P59WP_Pos      (28U)
#define RAMCFG_WPR2_P59WP_Msk      (0x1UL << RAMCFG_WPR2_P59WP_Pos)        /*!< 0x08000000 */
#define RAMCFG_WPR2_P59WP          RAMCFG_WPR2_P59WP_Msk                   /*!< Write Protection Page 59 */
#define RAMCFG_WPR2_P60WP_Pos      (29U)
#define RAMCFG_WPR2_P60WP_Msk      (0x1UL << RAMCFG_WPR2_P60WP_Pos)        /*!< 0x10000000 */
#define RAMCFG_WPR2_P60WP          RAMCFG_WPR2_P60WP_Msk                   /*!< Write Protection Page 60 */
#define RAMCFG_WPR2_P61WP_Pos      (30U)
#define RAMCFG_WPR2_P61WP_Msk      (0x1UL << RAMCFG_WPR2_P61WP_Pos)        /*!< 0x20000000 */
#define RAMCFG_WPR2_P61WP          RAMCFG_WPR2_P61WP_Msk                   /*!< Write Protection Page 61 */
#define RAMCFG_WPR2_P62WP_Pos      (31U)
#define RAMCFG_WPR2_P62WP_Msk      (0x1UL << RAMCFG_WPR2_P62WP_Pos)        /*!< 0x40000000 */
#define RAMCFG_WPR2_P62WP          RAMCFG_WPR2_P62WP_Msk                   /*!< Write Protection Page 62 */
#define RAMCFG_WPR2_P63WP_Pos      (31U)
#define RAMCFG_WPR2_P63WP_Msk      (0x1UL << RAMCFG_WPR2_P63WP_Pos)        /*!< 0x80000000 */
#define RAMCFG_WPR2_P63WP          RAMCFG_WPR2_P63WP_Msk                   /*!< Write Protection Page 63 */

/* *********************************   Bit definition for RAMCFG_ECCKEYR register   ********************************* */
#define RAMCFG_ECCKEYR_ECCKEY_Pos  (0U)
#define RAMCFG_ECCKEYR_ECCKEY_Msk  (0xFFUL << RAMCFG_ECCKEYR_ECCKEY_Pos)   /*!< 0x000000FF */
#define RAMCFG_ECCKEYR_ECCKEY      RAMCFG_ECCKEYR_ECCKEY_Msk               /*!< ECC write protection key */

/* *********************************   Bit definition for RAMCFG_ERKEYR register   ********************************** */
#define RAMCFG_ERKEYR_ERASEKEY_Pos (0U)
#define RAMCFG_ERKEYR_ERASEKEY_Msk (0xFFUL << RAMCFG_ERKEYR_ERASEKEY_Pos)  /*!< 0x000000FF */
#define RAMCFG_ERKEYR_ERASEKEY     RAMCFG_ERKEYR_ERASEKEY_Msk              /*!< Erase write protection key */

/**********************************************************************************************************************/
/*                                                                                                                    */
/*                                           Reset and Clock Control (RCC)                                            */
/*                                                                                                                    */
/**********************************************************************************************************************/
/* *************************************  Bit definition for RCC_CR1 register  ************************************** */
#define RCC_CR1_Rst                   (0x00000022UL)                             /*!< RCC_CR1 reset value */
#define RCC_CR1_HSISON_Pos            (0U)
#define RCC_CR1_HSISON_Msk            (0x1UL << RCC_CR1_HSISON_Pos)              /*!< 0x00000001 */
#define RCC_CR1_HSISON                RCC_CR1_HSISON_Msk                         /*!< HSIS clock enable */
#define RCC_CR1_HSIDIV3ON_Pos         (1U)
#define RCC_CR1_HSIDIV3ON_Msk         (0x1UL << RCC_CR1_HSIDIV3ON_Pos)           /*!< 0x00000002 */
#define RCC_CR1_HSIDIV3ON             RCC_CR1_HSIDIV3ON_Msk                      /*!< HSIDIV3 clock enable */
#define RCC_CR1_HSIKON_Pos            (2U)
#define RCC_CR1_HSIKON_Msk            (0x1UL << RCC_CR1_HSIKON_Pos)              /*!< 0x00000004 */
#define RCC_CR1_HSIKON                RCC_CR1_HSIKON_Msk                         /*!< HSIK clock enable */
#define RCC_CR1_HSIKERON_Pos          (3U)
#define RCC_CR1_HSIKERON_Msk          (0x1UL << RCC_CR1_HSIKERON_Pos)            /*!< 0x00000008 */
#define RCC_CR1_HSIKERON              RCC_CR1_HSIKERON_Msk                       /*!< HSI clock enable in Stop mode */
#define RCC_CR1_HSISRDY_Pos           (4U)
#define RCC_CR1_HSISRDY_Msk           (0x1UL << RCC_CR1_HSISRDY_Pos)             /*!< 0x00000010 */
#define RCC_CR1_HSISRDY               RCC_CR1_HSISRDY_Msk                        /*!< HSIS clock ready flag */
#define RCC_CR1_HSIDIV3RDY_Pos        (5U)
#define RCC_CR1_HSIDIV3RDY_Msk        (0x1UL << RCC_CR1_HSIDIV3RDY_Pos)          /*!< 0x00000020 */
#define RCC_CR1_HSIDIV3RDY            RCC_CR1_HSIDIV3RDY_Msk                     /*!< HSIDIV3 clock ready flag */
#define RCC_CR1_HSIKRDY_Pos           (6U)
#define RCC_CR1_HSIKRDY_Msk           (0x1UL << RCC_CR1_HSIKRDY_Pos)             /*!< 0x00000040 */
#define RCC_CR1_HSIKRDY               RCC_CR1_HSIKRDY_Msk                        /*!< HSIK clock ready flag */
#define RCC_CR1_PSISON_Pos            (8U)
#define RCC_CR1_PSISON_Msk            (0x1UL << RCC_CR1_PSISON_Pos)              /*!< 0x00000100 */
#define RCC_CR1_PSISON                RCC_CR1_PSISON_Msk                         /*!< PSIS clock enable */
#define RCC_CR1_PSIDIV3ON_Pos         (9U)
#define RCC_CR1_PSIDIV3ON_Msk         (0x1UL << RCC_CR1_PSIDIV3ON_Pos)           /*!< 0x00000200 */
#define RCC_CR1_PSIDIV3ON             RCC_CR1_PSIDIV3ON_Msk                      /*!< PSIDIV3 clock enable */
#define RCC_CR1_PSIKON_Pos            (10U)
#define RCC_CR1_PSIKON_Msk            (0x1UL << RCC_CR1_PSIKON_Pos)              /*!< 0x00000400 */
#define RCC_CR1_PSIKON                RCC_CR1_PSIKON_Msk                         /*!< PSIK clock enable */
#define RCC_CR1_PSIKERON_Pos          (11U)
#define RCC_CR1_PSIKERON_Msk          (0x1UL << RCC_CR1_PSIKERON_Pos)            /*!< 0x00000800 */
#define RCC_CR1_PSIKERON              RCC_CR1_PSIKERON_Msk                       /*!< PSI clock enable in Stop mode */
#define RCC_CR1_PSISRDY_Pos           (12U)
#define RCC_CR1_PSISRDY_Msk           (0x1UL << RCC_CR1_PSISRDY_Pos)             /*!< 0x00001000 */
#define RCC_CR1_PSISRDY               RCC_CR1_PSISRDY_Msk                        /*!< PSIS clock ready flag */
#define RCC_CR1_PSIDIV3RDY_Pos        (13U)
#define RCC_CR1_PSIDIV3RDY_Msk        (0x1UL << RCC_CR1_PSIDIV3RDY_Pos)          /*!< 0x00002000 */
#define RCC_CR1_PSIDIV3RDY            RCC_CR1_PSIDIV3RDY_Msk                     /*!< PSIDIV3 clock ready flag */
#define RCC_CR1_PSIKRDY_Pos           (14U)
#define RCC_CR1_PSIKRDY_Msk           (0x1UL << RCC_CR1_PSIKRDY_Pos)             /*!< 0x00004000 */
#define RCC_CR1_PSIKRDY               RCC_CR1_PSIKRDY_Msk                        /*!< PSIK clock ready flag */
#define RCC_CR1_HSEON_Pos             (16U)
#define RCC_CR1_HSEON_Msk             (0x1UL << RCC_CR1_HSEON_Pos)               /*!< 0x00010000 */
#define RCC_CR1_HSEON                 RCC_CR1_HSEON_Msk                          /*!< HSE clock enable */
#define RCC_CR1_HSERDY_Pos            (17U)
#define RCC_CR1_HSERDY_Msk            (0x1UL << RCC_CR1_HSERDY_Pos)              /*!< 0x00020000 */
#define RCC_CR1_HSERDY                RCC_CR1_HSERDY_Msk                         /*!< HSE clock ready flag */
#define RCC_CR1_HSEBYP_Pos            (18U)
#define RCC_CR1_HSEBYP_Msk            (0x1UL << RCC_CR1_HSEBYP_Pos)              /*!< 0x00040000 */
#define RCC_CR1_HSEBYP                RCC_CR1_HSEBYP_Msk                         /*!< HSE clock bypass */
#define RCC_CR1_HSECSSON_Pos          (19U)
#define RCC_CR1_HSECSSON_Msk          (0x1UL << RCC_CR1_HSECSSON_Pos)            /*!< 0x00080000 */
#define RCC_CR1_HSECSSON              RCC_CR1_HSECSSON_Msk                       /*!< HSE clock security system enable
                                                                                      */
#define RCC_CR1_HSEEXT_Pos            (20U)
#define RCC_CR1_HSEEXT_Msk            (0x1UL << RCC_CR1_HSEEXT_Pos)              /*!< 0x00100000 */
#define RCC_CR1_HSEEXT                RCC_CR1_HSEEXT_Msk                         /*!< External high speed clock type in
                                                                                      Bypass mode */

/* *************************************  Bit definition for RCC_CR2 register  ************************************** */
#define RCC_CR2_Rst                   (0x00000000UL)                             /*!< RCC_CR2 reset value */
#define RCC_CR2_HSIKDIV_Pos           (0U)
#define RCC_CR2_HSIKDIV_Msk           (0xFUL << RCC_CR2_HSIKDIV_Pos)             /*!< 0x0000000F */
#define RCC_CR2_HSIKDIV               RCC_CR2_HSIKDIV_Msk                        /*!< HSI clock out divider factor */
#define RCC_CR2_HSIKDIV_0             (0x1UL << RCC_CR2_HSIKDIV_Pos)             /*!< 0x00000001 */
#define RCC_CR2_HSIKDIV_1             (0x2UL << RCC_CR2_HSIKDIV_Pos)             /*!< 0x00000002 */
#define RCC_CR2_HSIKDIV_2             (0x4UL << RCC_CR2_HSIKDIV_Pos)             /*!< 0x00000004 */
#define RCC_CR2_HSIKDIV_3             (0x8UL << RCC_CR2_HSIKDIV_Pos)             /*!< 0x00000008 */
#define RCC_CR2_PSIKDIV_Pos           (8U)
#define RCC_CR2_PSIKDIV_Msk           (0xFUL << RCC_CR2_PSIKDIV_Pos)             /*!< 0x00000F00 */
#define RCC_CR2_PSIKDIV               RCC_CR2_PSIKDIV_Msk                        /*!< PSI clock out divider factor */
#define RCC_CR2_PSIKDIV_0             (0x1UL << RCC_CR2_PSIKDIV_Pos)             /*!< 0x00000100 */
#define RCC_CR2_PSIKDIV_1             (0x2UL << RCC_CR2_PSIKDIV_Pos)             /*!< 0x00000200 */
#define RCC_CR2_PSIKDIV_2             (0x4UL << RCC_CR2_PSIKDIV_Pos)             /*!< 0x00000400 */
#define RCC_CR2_PSIKDIV_3             (0x8UL << RCC_CR2_PSIKDIV_Pos)             /*!< 0x00000800 */
#define RCC_CR2_PSIREFSRC_Pos         (16U)
#define RCC_CR2_PSIREFSRC_Msk         (0x3UL << RCC_CR2_PSIREFSRC_Pos)           /*!< 0x00030000 */
#define RCC_CR2_PSIREFSRC             RCC_CR2_PSIREFSRC_Msk                      /*!< PSI reference clock source
                                                                                      selection */
#define RCC_CR2_PSIREFSRC_0           (0x1UL << RCC_CR2_PSIREFSRC_Pos)           /*!< 0x00010000 */
#define RCC_CR2_PSIREFSRC_1           (0x2UL << RCC_CR2_PSIREFSRC_Pos)           /*!< 0x00020000 */
#define RCC_CR2_PSIREF_Pos            (20U)
#define RCC_CR2_PSIREF_Msk            (0x7UL << RCC_CR2_PSIREF_Pos)              /*!< 0x00700000 */
#define RCC_CR2_PSIREF                RCC_CR2_PSIREF_Msk                         /*!< PSI reference clock frequency
                                                                                      selection */
#define RCC_CR2_PSIREF_0              (0x1UL << RCC_CR2_PSIREF_Pos)              /*!< 0x00100000 */
#define RCC_CR2_PSIREF_1              (0x2UL << RCC_CR2_PSIREF_Pos)              /*!< 0x00200000 */
#define RCC_CR2_PSIREF_2              (0x4UL << RCC_CR2_PSIREF_Pos)              /*!< 0x00400000 */
#define RCC_CR2_PSIFREQ_Pos           (28U)
#define RCC_CR2_PSIFREQ_Msk           (0x3UL << RCC_CR2_PSIFREQ_Pos)             /*!< 0x30000000 */
#define RCC_CR2_PSIFREQ               RCC_CR2_PSIFREQ_Msk                        /*!< PSI target frequency configuration
                                                                                      */
#define RCC_CR2_PSIFREQ_0             (0x1UL << RCC_CR2_PSIFREQ_Pos)             /*!< 0x10000000 */
#define RCC_CR2_PSIFREQ_1             (0x2UL << RCC_CR2_PSIFREQ_Pos)             /*!< 0x20000000 */

