MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c552xx.h
/********************  Bits definition for TAMP_BKP24R register  ***************/
#define TAMP_BKP24R_BKP_Pos               (0U)
#define TAMP_BKP24R_BKP_Msk               (0xFFFFFFFFUL << TAMP_BKP24R_BKP_Pos)   /*!< 0xFFFFFFFF */
#define TAMP_BKP24R_BKP                   TAMP_BKP24R_BKP_Msk                     /*!< The application can write or read data to and from these registers. */

/********************  Bits definition for TAMP_BKP25R register  ***************/
#define TAMP_BKP25R_BKP_Pos               (0U)
#define TAMP_BKP25R_BKP_Msk               (0xFFFFFFFFUL << TAMP_BKP25R_BKP_Pos)   /*!< 0xFFFFFFFF */
#define TAMP_BKP25R_BKP                   TAMP_BKP25R_BKP_Msk                     /*!< The application can write or read data to and from these registers. */

/********************  Bits definition for TAMP_BKP26R register  ***************/
#define TAMP_BKP26R_BKP_Pos              (0U)
#define TAMP_BKP26R_BKP_Msk              (0xFFFFFFFFUL << TAMP_BKP26R_BKP_Pos)   /*!< 0xFFFFFFFF */
#define TAMP_BKP26R_BKP                  TAMP_BKP26R_BKP_Msk                     /*!< The application can write or read data to and from these registers. */

/********************  Bits definition for TAMP_BKP27R register  ***************/
#define TAMP_BKP27R_BKP_Pos              (0U)
#define TAMP_BKP27R_BKP_Msk              (0xFFFFFFFFUL << TAMP_BKP27R_BKP_Pos)   /*!< 0xFFFFFFFF */
#define TAMP_BKP27R_BKP                  TAMP_BKP27R_BKP_Msk                     /*!< The application can write or read data to and from these registers. */

/********************  Bits definition for TAMP_BKP28R register  ***************/
#define TAMP_BKP28R_BKP_Pos              (0U)
#define TAMP_BKP28R_BKP_Msk              (0xFFFFFFFFUL << TAMP_BKP28R_BKP_Pos)   /*!< 0xFFFFFFFF */
#define TAMP_BKP28R_BKP                  TAMP_BKP28R_BKP_Msk                     /*!< The application can write or read data to and from these registers. */

/********************  Bits definition for TAMP_BKP29R register  ***************/
#define TAMP_BKP29R_BKP_Pos              (0U)
#define TAMP_BKP29R_BKP_Msk              (0xFFFFFFFFUL << TAMP_BKP29R_BKP_Pos)   /*!< 0xFFFFFFFF */
#define TAMP_BKP29R_BKP                  TAMP_BKP29R_BKP_Msk                     /*!< The application can write or read data to and from these registers. */

/********************  Bits definition for TAMP_BKP30R register  ***************/
#define TAMP_BKP30R_BKP_Pos             (0U)
#define TAMP_BKP30R_BKP_Msk             (0xFFFFFFFFUL << TAMP_BKP30R_BKP_Pos)   /*!< 0xFFFFFFFF */
#define TAMP_BKP30R_BKP                 TAMP_BKP30R_BKP_Msk                     /*!< The application can write or read data to and from these registers. */

/********************  Bits definition for TAMP_BKP31R register  ***************/
#define TAMP_BKP31R_BKP_Pos             (0U)
#define TAMP_BKP31R_BKP_Msk             (0xFFFFFFFFUL << TAMP_BKP31R_BKP_Pos)   /*!< 0xFFFFFFFF */
#define TAMP_BKP31R_BKP                 TAMP_BKP31R_BKP_Msk                     /*!< The application can write or read data to and from these registers. */

/******************************************************************************/
/*                                                                            */
/*                                    TIM                                     */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for TIM_CR1 register  ********************/
/*!< CEN configuration */
#define TIM_CR1_CEN_Pos      (0U)
#define TIM_CR1_CEN_Msk      (0x1UL << TIM_CR1_CEN_Pos)      /*!< 0x00000001 */
#define TIM_CR1_CEN          TIM_CR1_CEN_Msk                 /*!< CEN (Counter enable) */
/*!< UDIS configuration */
#define TIM_CR1_UDIS_Pos     (1U)
#define TIM_CR1_UDIS_Msk     (0x1UL << TIM_CR1_UDIS_Pos)     /*!< 0x00000002 */
#define TIM_CR1_UDIS         TIM_CR1_UDIS_Msk                /*!< UDIS (Update disable) */
/*!< URS configuration */
#define TIM_CR1_URS_Pos      (2U)
#define TIM_CR1_URS_Msk      (0x1UL << TIM_CR1_URS_Pos)      /*!< 0x00000004 */
#define TIM_CR1_URS          TIM_CR1_URS_Msk                 /*!< URS (Update request source) */
/*!< OPM configuration */
#define TIM_CR1_OPM_Pos      (3U)
#define TIM_CR1_OPM_Msk      (0x1UL << TIM_CR1_OPM_Pos)      /*!< 0x00000008 */
#define TIM_CR1_OPM          TIM_CR1_OPM_Msk                 /*!< OPM (One-pulse mode) */
/*!< DIR configuration */
#define TIM_CR1_DIR_Pos      (4U)
#define TIM_CR1_DIR_Msk      (0x1UL << TIM_CR1_DIR_Pos)      /*!< 0x00000010 */
#define TIM_CR1_DIR          TIM_CR1_DIR_Msk                 /*!< DIR (Direction) */
/*!< CMS configuration */
#define TIM_CR1_CMS_Pos      (5U)
#define TIM_CR1_CMS_Msk      (0x3UL << TIM_CR1_CMS_Pos)      /*!< 0x00000060 */
#define TIM_CR1_CMS          TIM_CR1_CMS_Msk                 /*!< CMS[1:0] bits (Center-aligned mode selection) */
#define TIM_CR1_CMS_0        (0x1UL << TIM_CR1_CMS_Pos)      /*!< 0x00000020 */
#define TIM_CR1_CMS_1        (0x2UL << TIM_CR1_CMS_Pos)      /*!< 0x00000040 */
/*!< ARPE configuration */
#define TIM_CR1_ARPE_Pos     (7U)
#define TIM_CR1_ARPE_Msk     (0x1UL << TIM_CR1_ARPE_Pos)     /*!< 0x00000080 */
#define TIM_CR1_ARPE         TIM_CR1_ARPE_Msk                /*!< ARPE (Auto-reload preload enable) */
/*!< CKD configuration */
#define TIM_CR1_CKD_Pos      (8U)
#define TIM_CR1_CKD_Msk      (0x3UL << TIM_CR1_CKD_Pos)      /*!< 0x00000300 */
#define TIM_CR1_CKD          TIM_CR1_CKD_Msk                 /*!< CKD[1:0] bits (Clock division) */
#define TIM_CR1_CKD_0        (0x1UL << TIM_CR1_CKD_Pos)      /*!< 0x00000100 */
#define TIM_CR1_CKD_1        (0x2UL << TIM_CR1_CKD_Pos)      /*!< 0x00000200 */
/*!< UIFREMAP configuration */
#define TIM_CR1_UIFREMAP_Pos (11U)
#define TIM_CR1_UIFREMAP_Msk (0x1UL << TIM_CR1_UIFREMAP_Pos) /*!< 0x00000800 */
#define TIM_CR1_UIFREMAP     TIM_CR1_UIFREMAP_Msk            /*!< UIFREMAP (UIF status bit remapping) */
/*!< DITHEN configuration */
#define TIM_CR1_DITHEN_Pos   (12U)
#define TIM_CR1_DITHEN_Msk   (0x1UL << TIM_CR1_DITHEN_Pos)   /*!< 0x00001000 */
#define TIM_CR1_DITHEN       TIM_CR1_DITHEN_Msk              /*!< DITHEN (Dithering enable) */
/*!< TGO2PSC configuration */
#define TIM_CR1_TGO2PSC_Pos  (16U)
#define TIM_CR1_TGO2PSC_Msk  (0x1FUL << TIM_CR1_TGO2PSC_Pos) /*!< 0x001F0000 */
#define TIM_CR1_TGO2PSC      TIM_CR1_TGO2PSC_Msk             /*!< TGO2PSC[4:0] bits (Trigger output 2 postscaler) */
/*!< CKD2 configuration */
#define TIM_CR1_CKD2_Pos     (24U)
#define TIM_CR1_CKD2_Msk     (0xFUL << TIM_CR1_CKD2_Pos)     /*!< 0x0F000000 */
#define TIM_CR1_CKD2         TIM_CR1_CKD2_Msk                /*!< CKD2[3:0] bits (Clock division 2) */
#define TIM_CR1_CKD2_0       (0x01UL << TIM_CR1_CKD2_Pos)    /*!< 0x01000000 */
#define TIM_CR1_CKD2_1       (0x02UL << TIM_CR1_CKD2_Pos)    /*!< 0x02000000 */
#define TIM_CR1_CKD2_2       (0x04UL << TIM_CR1_CKD2_Pos)    /*!< 0x04000000 */
#define TIM_CR1_CKD2_3       (0x08UL << TIM_CR1_CKD2_Pos)    /*!< 0x08000000 */

/********************  Bit definition for TIM_CR2 register  ********************/
/*!< CCPC configuration */
#define TIM_CR2_CCPC_Pos   (0U)
#define TIM_CR2_CCPC_Msk   (0x1UL << TIM_CR2_CCPC_Pos)     /*!< 0x00000001 */
#define TIM_CR2_CCPC       TIM_CR2_CCPC_Msk                /*!< CCPC (Capture/compare preloaded control) */
/*!< CCUS configuration */
#define TIM_CR2_CCUS_Pos   (2U)
#define TIM_CR2_CCUS_Msk   (0x1UL << TIM_CR2_CCUS_Pos)     /*!< 0x00000004 */
#define TIM_CR2_CCUS       TIM_CR2_CCUS_Msk                /*!< CCUS (Capture/compare control update selection) */
/*!< CCDS configuration */
#define TIM_CR2_CCDS_Pos   (3U)
#define TIM_CR2_CCDS_Msk   (0x1UL << TIM_CR2_CCDS_Pos)     /*!< 0x00000008 */
#define TIM_CR2_CCDS       TIM_CR2_CCDS_Msk                /*!< CCDS (Capture/compare DMA selection) */
/*!< MMS configuration */
#define TIM_CR2_MMS_Pos    (4U)
#define TIM_CR2_MMS_Msk    (0x200007UL << TIM_CR2_MMS_Pos) /*!< 0x02000070 */
#define TIM_CR2_MMS        TIM_CR2_MMS_Msk                 /*!< MMS[2:0] bits (Master mode selection) */
#define TIM_CR2_MMS_0      (0x000001UL << TIM_CR2_MMS_Pos) /*!< 0x00000010 */
#define TIM_CR2_MMS_1      (0x000002UL << TIM_CR2_MMS_Pos) /*!< 0x00000020 */
#define TIM_CR2_MMS_2      (0x000004UL << TIM_CR2_MMS_Pos) /*!< 0x00000040 */
#define TIM_CR2_MMS_3      (0x200000UL << TIM_CR2_MMS_Pos) /*!< 0x02000000 */
/*!< TI1S configuration */
#define TIM_CR2_TI1S_Pos   (7U)
#define TIM_CR2_TI1S_Msk   (0x1UL << TIM_CR2_TI1S_Pos)     /*!< 0x00000080 */
#define TIM_CR2_TI1S       TIM_CR2_TI1S_Msk                /*!< TI1S (tim_ti1 selection) */
/*!< OIS1 configuration */
#define TIM_CR2_OIS1_Pos   (8U)
#define TIM_CR2_OIS1_Msk   (0x1UL << TIM_CR2_OIS1_Pos)     /*!< 0x00000100 */
#define TIM_CR2_OIS1       TIM_CR2_OIS1_Msk                /*!< OIS1 (Output idle state 1 (tim_oc1 output)) */
/*!< OIS1N configuration */
#define TIM_CR2_OIS1N_Pos  (9U)
#define TIM_CR2_OIS1N_Msk  (0x1UL << TIM_CR2_OIS1N_Pos)    /*!< 0x00000200 */
#define TIM_CR2_OIS1N      TIM_CR2_OIS1N_Msk               /*!< OIS1N (Output idle state 1 (tim_oc1n output)) */
/*!< OIS2 configuration */
#define TIM_CR2_OIS2_Pos   (10U)
#define TIM_CR2_OIS2_Msk   (0x1UL << TIM_CR2_OIS2_Pos)     /*!< 0x00000400 */
#define TIM_CR2_OIS2       TIM_CR2_OIS2_Msk                /*!< OIS2 (Output idle state 2 (tim_oc2 output)) */
/*!< OIS2N configuration */
#define TIM_CR2_OIS2N_Pos  (11U)
#define TIM_CR2_OIS2N_Msk  (0x1UL << TIM_CR2_OIS2N_Pos)    /*!< 0x00000800 */
#define TIM_CR2_OIS2N      TIM_CR2_OIS2N_Msk               /*!< OIS2N (Output idle state 2 (tim_oc2n output)) */
/*!< OIS3 configuration */
#define TIM_CR2_OIS3_Pos   (12U)
#define TIM_CR2_OIS3_Msk   (0x1UL << TIM_CR2_OIS3_Pos)     /*!< 0x00001000 */
#define TIM_CR2_OIS3       TIM_CR2_OIS3_Msk                /*!< OIS3 (Output idle state 3 (tim_oc3 output)) */
/*!< OIS3N configuration */
#define TIM_CR2_OIS3N_Pos  (13U)
#define TIM_CR2_OIS3N_Msk  (0x1UL << TIM_CR2_OIS3N_Pos)    /*!< 0x00002000 */
#define TIM_CR2_OIS3N      TIM_CR2_OIS3N_Msk               /*!< OIS3N (Output idle state 3 (tim_oc3n output)) */
/*!< OIS4 configuration */
#define TIM_CR2_OIS4_Pos   (14U)
#define TIM_CR2_OIS4_Msk   (0x1UL << TIM_CR2_OIS4_Pos)     /*!< 0x00004000 */
#define TIM_CR2_OIS4       TIM_CR2_OIS4_Msk                /*!< OIS4 (Output idle state 4 (tim_oc4 output)) */
/*!< OIS4N configuration */
#define TIM_CR2_OIS4N_Pos  (15U)
#define TIM_CR2_OIS4N_Msk  (0x1UL << TIM_CR2_OIS4N_Pos)    /*!< 0x00008000 */
#define TIM_CR2_OIS4N      TIM_CR2_OIS4N_Msk               /*!< OIS4N (Output idle state 4 (tim_oc4n output)) */
/*!< OIS5 configuration */
#define TIM_CR2_OIS5_Pos   (16U)
#define TIM_CR2_OIS5_Msk   (0x1UL << TIM_CR2_OIS5_Pos)     /*!< 0x00010000 */
#define TIM_CR2_OIS5       TIM_CR2_OIS5_Msk                /*!< OIS5 (Output idle state 5 (tim_oc5 output)) */
/*!< OIS6 configuration */
#define TIM_CR2_OIS6_Pos   (18U)
#define TIM_CR2_OIS6_Msk   (0x1UL << TIM_CR2_OIS6_Pos)     /*!< 0x00040000 */
#define TIM_CR2_OIS6       TIM_CR2_OIS6_Msk                /*!< OIS6 (Output idle state 6 (tim_oc6 output)) */
/*!< OIS7 configuration */
#define TIM_CR2_OIS7_Pos   (19U)
#define TIM_CR2_OIS7_Msk   (0x1UL << TIM_CR2_OIS7_Pos)     /*!< 0x00080000 */
#define TIM_CR2_OIS7       TIM_CR2_OIS7_Msk                /*!< OIS7 (Output idle state 7 (tim_oc7 output)) */
/*!< MMS2 configuration */
#define TIM_CR2_MMS2_Pos   (20U)
#define TIM_CR2_MMS2_Msk   (0x1FUL << TIM_CR2_MMS2_Pos)    /*!< 0x01F00000 */
#define TIM_CR2_MMS2       TIM_CR2_MMS2_Msk                /*!< MMS2[4:0] bits (Master mode selection 2) */
#define TIM_CR2_MMS2_0     (0x01UL << TIM_CR2_MMS2_Pos)    /*!< 0x00100000 */
#define TIM_CR2_MMS2_1     (0x02UL << TIM_CR2_MMS2_Pos)    /*!< 0x00200000 */
#define TIM_CR2_MMS2_2     (0x04UL << TIM_CR2_MMS2_Pos)    /*!< 0x00400000 */
#define TIM_CR2_MMS2_3     (0x08UL << TIM_CR2_MMS2_Pos)    /*!< 0x00800000 */
#define TIM_CR2_MMS2_4     (0x10UL << TIM_CR2_MMS2_Pos)    /*!< 0x01000000 */
/*!< XORPS configuration */
#define TIM_CR2_XORPS_Pos  (27U)
#define TIM_CR2_XORPS_Msk  (0x1UL << TIM_CR2_XORPS_Pos)    /*!< 0x08000000 */
#define TIM_CR2_XORPS      TIM_CR2_XORPS_Msk               /*!< XORPS (XOR gate position selection) */
/*!< ADSYNC configuration */
#define TIM_CR2_ADSYNC_Pos (28U)
#define TIM_CR2_ADSYNC_Msk (0x1UL << TIM_CR2_ADSYNC_Pos)   /*!< 0x10000000 */
#define TIM_CR2_ADSYNC     TIM_CR2_ADSYNC_Msk              /*!< ADSYNC (ADC synchronization) */
/*!< TI1INV configuration */
#define TIM_CR2_TI1INV_Pos (29U)
#define TIM_CR2_TI1INV_Msk (0x1UL << TIM_CR2_TI1INV_Pos)   /*!< 0x20000000 */
#define TIM_CR2_TI1INV     TIM_CR2_TI1INV_Msk              /*!< TI1INV (tim_ti{1} signal inversion on XOR gate input) */
/*!< TI2INV configuration */
#define TIM_CR2_TI2INV_Pos (30U)
#define TIM_CR2_TI2INV_Msk (0x1UL << TIM_CR2_TI2INV_Pos)   /*!< 0x40000000 */
#define TIM_CR2_TI2INV     TIM_CR2_TI2INV_Msk              /*!< TI2INV (tim_ti{1} signal inversion on XOR gate input) */
/*!< TI3INV configuration */
#define TIM_CR2_TI3INV_Pos (31U)
#define TIM_CR2_TI3INV_Msk (0x1UL << TIM_CR2_TI3INV_Pos)   /*!< 0x80000000 */
#define TIM_CR2_TI3INV     TIM_CR2_TI3INV_Msk              /*!< TI3INV (tim_ti{1} signal inversion on XOR gate input) */

/********************  Bit definition for TIM_SMCR register  ********************/
/*!< SMS configuration */
#define TIM_SMCR_SMS_Pos   (0U)
#define TIM_SMCR_SMS_Msk   (0x30007UL << TIM_SMCR_SMS_Pos) /*!< 0x00030007 */
#define TIM_SMCR_SMS       TIM_SMCR_SMS_Msk                /*!< SMS[2:0] bits (Slave mode selection) */
#define TIM_SMCR_SMS_0     (0x00001UL << TIM_SMCR_SMS_Pos) /*!< 0x00000001 */
#define TIM_SMCR_SMS_1     (0x00002UL << TIM_SMCR_SMS_Pos) /*!< 0x00000002 */
#define TIM_SMCR_SMS_2     (0x00004UL << TIM_SMCR_SMS_Pos) /*!< 0x00000004 */
#define TIM_SMCR_SMS_3     (0x10000UL << TIM_SMCR_SMS_Pos) /*!< 0x00010000 */
#define TIM_SMCR_SMS_4     (0x20000UL << TIM_SMCR_SMS_Pos) /*!< 0x00020000 */
/*!< OCCS configuration */
#define TIM_SMCR_OCCS_Pos  (3U)
#define TIM_SMCR_OCCS_Msk  (0x1UL << TIM_SMCR_OCCS_Pos)    /*!< 0x00000008 */
#define TIM_SMCR_OCCS      TIM_SMCR_OCCS_Msk               /*!< OCCS (OCREF clear selection) */
/*!< TS configuration */
#define TIM_SMCR_TS_Pos    (4U)
#define TIM_SMCR_TS_Msk    (0x30007UL << TIM_SMCR_TS_Pos)  /*!< 0x00300070 */
#define TIM_SMCR_TS        TIM_SMCR_TS_Msk                 /*!< TS[2:0] bits (Trigger selection) */
#define TIM_SMCR_TS_0      (0x00001UL << TIM_SMCR_TS_Pos)  /*!< 0x00000010 */
#define TIM_SMCR_TS_1      (0x00002UL << TIM_SMCR_TS_Pos)  /*!< 0x00000020 */
#define TIM_SMCR_TS_2      (0x00004UL << TIM_SMCR_TS_Pos)  /*!< 0x00000040 */
#define TIM_SMCR_TS_3      (0x10000UL << TIM_SMCR_TS_Pos)  /*!< 0x00100000 */
#define TIM_SMCR_TS_4      (0x20000UL << TIM_SMCR_TS_Pos)  /*!< 0x00200000 */
/*!< MSM configuration */
#define TIM_SMCR_MSM_Pos   (7U)
#define TIM_SMCR_MSM_Msk   (0x1UL << TIM_SMCR_MSM_Pos)     /*!< 0x00000080 */
#define TIM_SMCR_MSM       TIM_SMCR_MSM_Msk                /*!< MSM (Master/slave mode) */
/*!< ETF configuration */
#define TIM_SMCR_ETF_Pos   (8U)
#define TIM_SMCR_ETF_Msk   (0xFUL << TIM_SMCR_ETF_Pos)     /*!< 0x00000F00 */
#define TIM_SMCR_ETF       TIM_SMCR_ETF_Msk                /*!< ETF[3:0] bits (External trigger filter) */
#define TIM_SMCR_ETF_0     (0x01UL << TIM_SMCR_ETF_Pos)    /*!< 0x00000100 */
#define TIM_SMCR_ETF_1     (0x02UL << TIM_SMCR_ETF_Pos)    /*!< 0x00000200 */
#define TIM_SMCR_ETF_2     (0x04UL << TIM_SMCR_ETF_Pos)    /*!< 0x00000400 */
#define TIM_SMCR_ETF_3     (0x08UL << TIM_SMCR_ETF_Pos)    /*!< 0x00000800 */
/*!< ETPS configuration */
#define TIM_SMCR_ETPS_Pos  (12U)
#define TIM_SMCR_ETPS_Msk  (0x3UL << TIM_SMCR_ETPS_Pos)    /*!< 0x00003000 */
#define TIM_SMCR_ETPS      TIM_SMCR_ETPS_Msk               /*!< ETPS[1:0] bits (External trigger prescaler) */
#define TIM_SMCR_ETPS_0    (0x1UL << TIM_SMCR_ETPS_Pos)    /*!< 0x00001000 */
#define TIM_SMCR_ETPS_1    (0x2UL << TIM_SMCR_ETPS_Pos)    /*!< 0x00002000 */
/*!< ECE configuration */
#define TIM_SMCR_ECE_Pos   (14U)
#define TIM_SMCR_ECE_Msk   (0x1UL << TIM_SMCR_ECE_Pos)     /*!< 0x00004000 */
#define TIM_SMCR_ECE       TIM_SMCR_ECE_Msk                /*!< ECE (External clock enable) */
/*!< ETP configuration */
#define TIM_SMCR_ETP_Pos   (15U)
#define TIM_SMCR_ETP_Msk   (0x1UL << TIM_SMCR_ETP_Pos)     /*!< 0x00008000 */
#define TIM_SMCR_ETP       TIM_SMCR_ETP_Msk                /*!< ETP (External trigger polarity) */
/*!< SMSPE configuration */
#define TIM_SMCR_SMSPE_Pos (24U)
#define TIM_SMCR_SMSPE_Msk (0x1UL << TIM_SMCR_SMSPE_Pos)   /*!< 0x01000000 */
#define TIM_SMCR_SMSPE     TIM_SMCR_SMSPE_Msk              /*!< SMSPE (SMS preload enable) */
/*!< SMSPS configuration */
#define TIM_SMCR_SMSPS_Pos (25U)
#define TIM_SMCR_SMSPS_Msk (0x1UL << TIM_SMCR_SMSPS_Pos)   /*!< 0x02000000 */
#define TIM_SMCR_SMSPS     TIM_SMCR_SMSPS_Msk              /*!< SMSPS (SMS preload source) */
/*!< SETPS configuration */
#define TIM_SMCR_SETPS_Pos (26U)
#define TIM_SMCR_SETPS_Msk (0xFUL << TIM_SMCR_SETPS_Pos)   /*!< 0x3C000000 */
#define TIM_SMCR_SETPS     TIM_SMCR_SETPS_Msk              /*!< SETPS[3:0] bits (Synchronous External Trigger Prescaler) */
#define TIM_SMCR_SETPS_0   (0x01UL << TIM_SMCR_SETPS_Pos)  /*!< 0x04000000 */
#define TIM_SMCR_SETPS_1   (0x02UL << TIM_SMCR_SETPS_Pos)  /*!< 0x08000000 */
#define TIM_SMCR_SETPS_2   (0x04UL << TIM_SMCR_SETPS_Pos)  /*!< 0x10000000 */
#define TIM_SMCR_SETPS_3   (0x08UL << TIM_SMCR_SETPS_Pos)  /*!< 0x20000000 */

/********************  Bit definition for TIM_DIER register  ********************/
/*!< UIE configuration */
#define TIM_DIER_UIE_Pos    (0U)
#define TIM_DIER_UIE_Msk    (0x1UL << TIM_DIER_UIE_Pos)    /*!< 0x00000001 */
#define TIM_DIER_UIE        TIM_DIER_UIE_Msk               /*!< UIE (Update interrupt enable) */
/*!< CC1IE configuration */
#define TIM_DIER_CC1IE_Pos  (1U)
#define TIM_DIER_CC1IE_Msk  (0x1UL << TIM_DIER_CC1IE_Pos)  /*!< 0x00000002 */
#define TIM_DIER_CC1IE      TIM_DIER_CC1IE_Msk             /*!< CC1IE (Capture/compare 1 interrupt enable) */
/*!< CC2IE configuration */
#define TIM_DIER_CC2IE_Pos  (2U)
#define TIM_DIER_CC2IE_Msk  (0x1UL << TIM_DIER_CC2IE_Pos)  /*!< 0x00000004 */
#define TIM_DIER_CC2IE      TIM_DIER_CC2IE_Msk             /*!< CC2IE (Capture/compare 2 interrupt enable) */
/*!< CC3IE configuration */
#define TIM_DIER_CC3IE_Pos  (3U)
#define TIM_DIER_CC3IE_Msk  (0x1UL << TIM_DIER_CC3IE_Pos)  /*!< 0x00000008 */
#define TIM_DIER_CC3IE      TIM_DIER_CC3IE_Msk             /*!< CC3IE (Capture/compare 3 interrupt enable) */
/*!< CC4IE configuration */
#define TIM_DIER_CC4IE_Pos  (4U)
#define TIM_DIER_CC4IE_Msk  (0x1UL << TIM_DIER_CC4IE_Pos)  /*!< 0x00000010 */
#define TIM_DIER_CC4IE      TIM_DIER_CC4IE_Msk             /*!< CC4IE (Capture/compare 4 interrupt enable) */
/*!< COMIE configuration */
#define TIM_DIER_COMIE_Pos  (5U)
#define TIM_DIER_COMIE_Msk  (0x1UL << TIM_DIER_COMIE_Pos)  /*!< 0x00000020 */
#define TIM_DIER_COMIE      TIM_DIER_COMIE_Msk             /*!< COMIE (COM interrupt enable) */
/*!< TIE configuration */
#define TIM_DIER_TIE_Pos    (6U)
#define TIM_DIER_TIE_Msk    (0x1UL << TIM_DIER_TIE_Pos)    /*!< 0x00000040 */
#define TIM_DIER_TIE        TIM_DIER_TIE_Msk               /*!< TIE (Trigger interrupt enable) */
/*!< BIE configuration */
#define TIM_DIER_BIE_Pos    (7U)
#define TIM_DIER_BIE_Msk    (0x1UL << TIM_DIER_BIE_Pos)    /*!< 0x00000080 */
#define TIM_DIER_BIE        TIM_DIER_BIE_Msk               /*!< BIE (Break interrupt enable) */
/*!< UDE configuration */
#define TIM_DIER_UDE_Pos    (8U)
#define TIM_DIER_UDE_Msk    (0x1UL << TIM_DIER_UDE_Pos)    /*!< 0x00000100 */
#define TIM_DIER_UDE        TIM_DIER_UDE_Msk               /*!< UDE (Update DMA request enable) */
/*!< CC1DE configuration */
#define TIM_DIER_CC1DE_Pos  (9U)
#define TIM_DIER_CC1DE_Msk  (0x1UL << TIM_DIER_CC1DE_Pos)  /*!< 0x00000200 */
#define TIM_DIER_CC1DE      TIM_DIER_CC1DE_Msk             /*!< CC1DE (Capture/compare 1 DMA request enable) */
/*!< CC2DE configuration */
#define TIM_DIER_CC2DE_Pos  (10U)
#define TIM_DIER_CC2DE_Msk  (0x1UL << TIM_DIER_CC2DE_Pos)  /*!< 0x00000400 */
#define TIM_DIER_CC2DE      TIM_DIER_CC2DE_Msk             /*!< CC2DE (Capture/compare 2 DMA request enable) */
/*!< CC3DE configuration */
#define TIM_DIER_CC3DE_Pos  (11U)
#define TIM_DIER_CC3DE_Msk  (0x1UL << TIM_DIER_CC3DE_Pos)  /*!< 0x00000800 */
#define TIM_DIER_CC3DE      TIM_DIER_CC3DE_Msk             /*!< CC3DE (Capture/compare 3 DMA request enable) */
/*!< CC4DE configuration */
#define TIM_DIER_CC4DE_Pos  (12U)
#define TIM_DIER_CC4DE_Msk  (0x1UL << TIM_DIER_CC4DE_Pos)  /*!< 0x00001000 */
#define TIM_DIER_CC4DE      TIM_DIER_CC4DE_Msk             /*!< CC4DE (Capture/compare 4 DMA request enable) */
/*!< COMDE configuration */
#define TIM_DIER_COMDE_Pos  (13U)
#define TIM_DIER_COMDE_Msk  (0x1UL << TIM_DIER_COMDE_Pos)  /*!< 0x00002000 */
#define TIM_DIER_COMDE      TIM_DIER_COMDE_Msk             /*!< COMDE (COM DMA request enable) */
/*!< TDE configuration */
#define TIM_DIER_TDE_Pos    (14U)
#define TIM_DIER_TDE_Msk    (0x1UL << TIM_DIER_TDE_Pos)    /*!< 0x00004000 */
#define TIM_DIER_TDE        TIM_DIER_TDE_Msk               /*!< TDE (Trigger DMA request enable) */
/*!< IDXIE configuration */
#define TIM_DIER_IDXIE_Pos  (20U)
#define TIM_DIER_IDXIE_Msk  (0x1UL << TIM_DIER_IDXIE_Pos)  /*!< 0x00100000 */
#define TIM_DIER_IDXIE      TIM_DIER_IDXIE_Msk             /*!< IDXIE (Index interrupt enable) */
/*!< DIRIE configuration */
#define TIM_DIER_DIRIE_Pos  (21U)
#define TIM_DIER_DIRIE_Msk  (0x1UL << TIM_DIER_DIRIE_Pos)  /*!< 0x00200000 */
#define TIM_DIER_DIRIE      TIM_DIER_DIRIE_Msk             /*!< DIRIE (Direction change interrupt enable) */
/*!< IERRIE configuration */
#define TIM_DIER_IERRIE_Pos (22U)
#define TIM_DIER_IERRIE_Msk (0x1UL << TIM_DIER_IERRIE_Pos) /*!< 0x00400000 */
#define TIM_DIER_IERRIE     TIM_DIER_IERRIE_Msk            /*!< IERRIE (Index error interrupt enable) */
/*!< TERRIE configuration */
#define TIM_DIER_TERRIE_Pos (23U)
#define TIM_DIER_TERRIE_Msk (0x1UL << TIM_DIER_TERRIE_Pos) /*!< 0x00800000 */
#define TIM_DIER_TERRIE     TIM_DIER_TERRIE_Msk            /*!< TERRIE (Transition error interrupt enable) */

