MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c552xx.h
/********************  Bit definition for TIM_MPR1 register  ********************/
/*!< BK1M configuration */
#define TIM_MPR1_BK1M_Pos      (0U)
#define TIM_MPR1_BK1M_Msk      (0x3UL << TIM_MPR1_BK1M_Pos)  /*!< 0x00000003 */
#define TIM_MPR1_BK1M          TIM_MPR1_BK1M_Msk             /*!< BK1M[1:0] bits (Break mode for tim_oc1 output) */
#define TIM_MPR1_BK1M_0        (0x1UL << TIM_MPR1_BK1M_Pos)  /*!< 0x00000001 */
#define TIM_MPR1_BK1M_1        (0x2UL << TIM_MPR1_BK1M_Pos)  /*!< 0x00000002 */
/*!< BK1NM configuration */
#define TIM_MPR1_BK1NM_Pos     (2U)
#define TIM_MPR1_BK1NM_Msk     (0x3UL << TIM_MPR1_BK1NM_Pos) /*!< 0x0000000C */
#define TIM_MPR1_BK1NM         TIM_MPR1_BK1NM_Msk            /*!< BK1NM[1:0] bits (Break mode for tim_oc1n output) */
#define TIM_MPR1_BK1NM_0       (0x1UL << TIM_MPR1_BK1NM_Pos) /*!< 0x00000004 */
#define TIM_MPR1_BK1NM_1       (0x2UL << TIM_MPR1_BK1NM_Pos) /*!< 0x00000008 */
/*!< BK2M configuration */
#define TIM_MPR1_BK2M_Pos      (4U)
#define TIM_MPR1_BK2M_Msk      (0x3UL << TIM_MPR1_BK2M_Pos)  /*!< 0x00000030 */
#define TIM_MPR1_BK2M          TIM_MPR1_BK2M_Msk             /*!< BK2M[1:0] bits (Break mode for tim_oc2 output) */
#define TIM_MPR1_BK2M_0        (0x1UL << TIM_MPR1_BK2M_Pos)  /*!< 0x00000010 */
#define TIM_MPR1_BK2M_1        (0x2UL << TIM_MPR1_BK2M_Pos)  /*!< 0x00000020 */
/*!< BK2NM configuration */
#define TIM_MPR1_BK2NM_Pos     (6U)
#define TIM_MPR1_BK2NM_Msk     (0x3UL << TIM_MPR1_BK2NM_Pos) /*!< 0x000000C0 */
#define TIM_MPR1_BK2NM         TIM_MPR1_BK2NM_Msk            /*!< BK2NM[1:0] bits (Break mode for tim_oc2n output) */
#define TIM_MPR1_BK2NM_0       (0x1UL << TIM_MPR1_BK2NM_Pos) /*!< 0x00000040 */
#define TIM_MPR1_BK2NM_1       (0x2UL << TIM_MPR1_BK2NM_Pos) /*!< 0x00000080 */
/*!< BK3M configuration */
#define TIM_MPR1_BK3M_Pos      (8U)
#define TIM_MPR1_BK3M_Msk      (0x3UL << TIM_MPR1_BK3M_Pos)  /*!< 0x00000300 */
#define TIM_MPR1_BK3M          TIM_MPR1_BK3M_Msk             /*!< BK3M[1:0] bits (Break mode for tim_oc3 output) */
#define TIM_MPR1_BK3M_0        (0x1UL << TIM_MPR1_BK3M_Pos)  /*!< 0x00000100 */
#define TIM_MPR1_BK3M_1        (0x2UL << TIM_MPR1_BK3M_Pos)  /*!< 0x00000200 */
/*!< BK3NM configuration */
#define TIM_MPR1_BK3NM_Pos     (10U)
#define TIM_MPR1_BK3NM_Msk     (0x3UL << TIM_MPR1_BK3NM_Pos) /*!< 0x00000C00 */
#define TIM_MPR1_BK3NM         TIM_MPR1_BK3NM_Msk            /*!< BK3NM[1:0] bits (Break mode for tim_oc3n output) */
#define TIM_MPR1_BK3NM_0       (0x1UL << TIM_MPR1_BK3NM_Pos) /*!< 0x00000400 */
#define TIM_MPR1_BK3NM_1       (0x2UL << TIM_MPR1_BK3NM_Pos) /*!< 0x00000800 */
/*!< BK4M configuration */
#define TIM_MPR1_BK4M_Pos      (12U)
#define TIM_MPR1_BK4M_Msk      (0x3UL << TIM_MPR1_BK4M_Pos)  /*!< 0x00003000 */
#define TIM_MPR1_BK4M          TIM_MPR1_BK4M_Msk             /*!< BK4M[1:0] bits (Break mode for tim_oc4 output) */
#define TIM_MPR1_BK4M_0        (0x1UL << TIM_MPR1_BK4M_Pos)  /*!< 0x00001000 */
#define TIM_MPR1_BK4M_1        (0x2UL << TIM_MPR1_BK4M_Pos)  /*!< 0x00002000 */
/*!< BK4NM configuration */
#define TIM_MPR1_BK4NM_Pos     (14U)
#define TIM_MPR1_BK4NM_Msk     (0x3UL << TIM_MPR1_BK4NM_Pos) /*!< 0x0000C000 */
#define TIM_MPR1_BK4NM         TIM_MPR1_BK4NM_Msk            /*!< BK4NM[1:0] bits (Break mode for tim_oc4n output) */
#define TIM_MPR1_BK4NM_0       (0x1UL << TIM_MPR1_BK4NM_Pos) /*!< 0x00004000 */
#define TIM_MPR1_BK4NM_1       (0x2UL << TIM_MPR1_BK4NM_Pos) /*!< 0x00008000 */

/********************  Bit definition for TIM_MPR2 register  ********************/
/*!< DBK1 configuration */
#define TIM_MPR2_DBK1_Pos      (0U)
#define TIM_MPR2_DBK1_Msk      (0xFFUL << TIM_MPR2_DBK1_Pos)  /*!< 0x000000FF */
#define TIM_MPR2_DBK1          TIM_MPR2_DBK1_Msk              /*!< DBK1[7:0] bits (Delayed 1 Break duration) */
/*!< DBK2 configuration */
#define TIM_MPR2_DBK2_Pos      (16U)
#define TIM_MPR2_DBK2_Msk      (0xFFUL << TIM_MPR2_DBK2_Pos)  /*!< 0x00FF0000 */
#define TIM_MPR2_DBK2          TIM_MPR2_DBK2_Msk              /*!< DBK2[7:0] bits (Delayed 2 Break duration) */

/********************  Bit definition for TIM_OOR register  ********************/
#define TIM_OOR_OOS1_Pos       (0U)
#define TIM_OOR_OOS1_Msk       (0x1UL << TIM_OOR_OOS1_Pos)  /*!< 0x00000001 */
#define TIM_OOR_OOS1           TIM_OOR_OOS1_Msk             /*!< OOS1 (Output override state for output tim_oc1n) */
/*!< OOS1N configuration */
#define TIM_OOR_OOS1N_Pos      (1U)
#define TIM_OOR_OOS1N_Msk      (0x1UL << TIM_OOR_OOS1N_Pos) /*!< 0x00000002 */
#define TIM_OOR_OOS1N          TIM_OOR_OOS1N_Msk            /*!< OOS1N (Output override state for output tim_oc1n) */
/*!< OOS2 configuration */
#define TIM_OOR_OOS2_Pos       (2U)
#define TIM_OOR_OOS2_Msk       (0x1UL << TIM_OOR_OOS2_Pos)  /*!< 0x00000004 */
#define TIM_OOR_OOS2           TIM_OOR_OOS2_Msk             /*!< OOS2 (Output override state for output tim_oc2n) */
/*!< OOS2N configuration */
#define TIM_OOR_OOS2N_Pos      (3U)
#define TIM_OOR_OOS2N_Msk      (0x1UL << TIM_OOR_OOS2N_Pos) /*!< 0x00000008 */
#define TIM_OOR_OOS2N          TIM_OOR_OOS2N_Msk            /*!< OOS2N (Output override state for output tim_oc2n) */
/*!< OOS3 configuration */
#define TIM_OOR_OOS3_Pos       (4U)
#define TIM_OOR_OOS3_Msk       (0x1UL << TIM_OOR_OOS3_Pos)  /*!< 0x00000010 */
#define TIM_OOR_OOS3           TIM_OOR_OOS3_Msk             /*!< OOS3 (Output override state for output tim_oc3n) */
/*!< OOS3N configuration */
#define TIM_OOR_OOS3N_Pos      (5U)
#define TIM_OOR_OOS3N_Msk      (0x1UL << TIM_OOR_OOS3N_Pos) /*!< 0x00000020 */
#define TIM_OOR_OOS3N          TIM_OOR_OOS3N_Msk            /*!< OOS3N (Output override state for output tim_oc3n) */
/*!< OOS4 configuration */
#define TIM_OOR_OOS4_Pos       (6U)
#define TIM_OOR_OOS4_Msk       (0x1UL << TIM_OOR_OOS4_Pos)  /*!< 0x00000040 */
#define TIM_OOR_OOS4           TIM_OOR_OOS4_Msk             /*!< OOS4 (Output override state for output tim_oc4n) */
/*!< OOS4N configuration */
#define TIM_OOR_OOS4N_Pos      (7U)
#define TIM_OOR_OOS4N_Msk      (0x1UL << TIM_OOR_OOS4N_Pos) /*!< 0x00000080 */
#define TIM_OOR_OOS4N          TIM_OOR_OOS4N_Msk            /*!< OOS4N (Output override state for output tim_oc4n) */
/*!< OOC configuration */
#define TIM_OOR_OOC_Pos        (12U)
#define TIM_OOR_OOC_Msk        (0x1UL << TIM_OOR_OOC_Pos)   /*!< 0x00001000 */
#define TIM_OOR_OOC            TIM_OOR_OOC_Msk              /*!< OOC (Output override control) */

/********************  Bit definition for TIM_DCR register  ********************/
/*!< DBA configuration */
#define TIM_DCR_DBA_Pos        (0U)
#define TIM_DCR_DBA_Msk        (0x1FUL << TIM_DCR_DBA_Pos)  /*!< 0x0000001F */
#define TIM_DCR_DBA            TIM_DCR_DBA_Msk              /*!< DBA[4:0] bits (DMA base address) */
#define TIM_DCR_DBA_0          (0x01UL << TIM_DCR_DBA_Pos)  /*!< 0x00000001 */
#define TIM_DCR_DBA_1          (0x02UL << TIM_DCR_DBA_Pos)  /*!< 0x00000002 */
#define TIM_DCR_DBA_2          (0x04UL << TIM_DCR_DBA_Pos)  /*!< 0x00000004 */
#define TIM_DCR_DBA_3          (0x08UL << TIM_DCR_DBA_Pos)  /*!< 0x00000008 */
#define TIM_DCR_DBA_4          (0x10UL << TIM_DCR_DBA_Pos)  /*!< 0x00000010 */
/*!< DBL configuration */
#define TIM_DCR_DBL_Pos        (8U)
#define TIM_DCR_DBL_Msk        (0x1FUL << TIM_DCR_DBL_Pos)  /*!< 0x00001F00 */
#define TIM_DCR_DBL            TIM_DCR_DBL_Msk              /*!< DBL[4:0] bits (DMA burst length) */
#define TIM_DCR_DBL_0          (0x01UL << TIM_DCR_DBL_Pos)  /*!< 0x00000100 */
#define TIM_DCR_DBL_1          (0x02UL << TIM_DCR_DBL_Pos)  /*!< 0x00000200 */
#define TIM_DCR_DBL_2          (0x04UL << TIM_DCR_DBL_Pos)  /*!< 0x00000400 */
#define TIM_DCR_DBL_3          (0x08UL << TIM_DCR_DBL_Pos)  /*!< 0x00000800 */
#define TIM_DCR_DBL_4          (0x10UL << TIM_DCR_DBL_Pos)  /*!< 0x00001000 */
/*!< DBSS configuration */
#define TIM_DCR_DBSS_Pos       (16U)
#define TIM_DCR_DBSS_Msk       (0xFUL << TIM_DCR_DBSS_Pos)  /*!< 0x000F0000 */
#define TIM_DCR_DBSS           TIM_DCR_DBSS_Msk             /*!< DBSS[3:0] bits (DMA burst source selection) */
#define TIM_DCR_DBSS_0         (0x01UL << TIM_DCR_DBSS_Pos) /*!< 0x00010000 */
#define TIM_DCR_DBSS_1         (0x02UL << TIM_DCR_DBSS_Pos) /*!< 0x00020000 */
#define TIM_DCR_DBSS_2         (0x04UL << TIM_DCR_DBSS_Pos) /*!< 0x00040000 */
#define TIM_DCR_DBSS_3         (0x08UL << TIM_DCR_DBSS_Pos) /*!< 0x00080000 */

